pkg = gg.PACKAGE
vrgn = gg.VERSION_INT
pkg_1 = 'com.elngome'
if pkg ~=pkg_1  then
gg.alert("✰قم باستخدام جبم جاردن النجوم✰")
os.exit()
end
gg.setVisible(false)
  local code = math.random(100, 900)
local passwordEntered = false
while not passwordEntered do
  local pass = gg.prompt({"   🔐 Enter Password 🔐:-" .. code .. " !"}, { [1] = " 🔐Password🔐" }, { [1] = "number" })
  if not pass then return end
  if pass[1] .. "0" == code .. "0" then passwordEntered = true
    gg.toast("✔️ Cᴏʀʀᴇᴄᴛ Pᴀssᴡᴏʀᴅ ✔️\n   🔓 Wᴇʟᴄᴏᴍᴇ 🔓")
  else
    gg.alert("❌ Wʀᴏɴɢ Pᴀssᴡᴏʀᴅ Pʟᴇᴀsᴇ Tʀʏ Aɢᴀɪɴ! ❌")
  end
end
------------------------------------Processes---------------------------------------------------------------
	
 function NOGOM(search,type,refine,results,edit,S,R,E,C)
	srch = tostring (search)
    rfn = tostring (refine)          
    edt = tostring (edit)
	if S == 1 then gg.searchNumber(srch , type, false, 536870912, 0, -1, 0) end
	if R ==1 then gg.refineNumber(rfn ,type,false,536870912,0,-1,0) end
    local table = gg.getResults(results, nil, nil, nil, nil, nil, nil, nil, nil)
	if E == 1 then gg.editAll(edt, type) end
	if C == 1 then gg.clearResults() end
end
------------------------------------------HOME----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
gg.alert("\t\t\t\t\t\t\t╔╰❥❣✰═════✬⋆✪⋆✬═════✰❣✿╗\n\t\t\t\t\t\t\t↣╰❥❣✰══✬⋆﷽⋆✬══✰❣✿ \n\t\t\t\t\t\t\t╚╰❥❣✰═══✬⋆ELNGOME⋆✬═══✰❣✿╝") 
gg.alert(os.date("\t\t\t\t\t📅 %d %B %Y        \t\t\t\t\t\t\t\t\t🕐%I:%M:%S\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t♛★صلي على النبي★♛ \n\n\t\t\t\t\t\t\t\t\t\t♛★اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَامُحَمد ﷺ★♛"))
gg.setVisible(false)
gg.sleep(200)
gg.toast("Loading.. ")
gg.sleep(200)
gg.toast("▓▒▒▒▒0%▒▒▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓5%▒▒▒▒▒")
gg.sleep(100)
gg.toast("▓▓▒▒▒10%▒▒▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▒▒15%▒▒▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▒20%▒▒▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓25%▓▒▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓50%▓▓▒▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓75%▓▓▓▒▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓99%▓▓▓▓▒")
gg.sleep(150)
gg.toast("▓▓▓▓▓100%▓▓▓▓▓")
gg.sleep(200)
gg.toast("E")
gg.sleep(200)
gg.toast("EL")
gg.sleep(200)
gg.toast("ELN")
gg.sleep(200)
gg.toast("ELNG")
gg.sleep(200)
gg.toast("ELNGO")
gg.sleep(200)
gg.toast("ELNGOM")
gg.sleep(200)
gg.toast("ELNGOME")

hh=(os.date("\t\t\t\t\t\t\t\t\t📅 %d %B %Y       \t\t\t\t\t\t\t\t\t🕐%I:%M:%S \n\t\t\t\t\t╔╰❥❣✰═══════✬⋆✪⋆✬═══════✰❣✿╗\n\t\t\t\t\t    ↣╰❥❣✰═══✬⋆SCRIPT ELNGOME⋆✬═══✰❣✿ \n\t\t\t\t\t╚╰❥❣✰═════✬⋆ELNGOME⋆✬═════✰❣✿╝"))
elngooom ={"➊ القسم الشامل ➊","➋ قسم الحظ و التسريع ➋","➌ قائمة بيت الحيوان ➌" ,"➍ التفعيلات الخاصة ➍","➎ المنتجع ➎","➏ شراء منتجات بنقود صفراء ➏","➐ زرع المختبر ➐","➑ فعالية التلقائي ➑","➒ روابط وأكواد المزرعه ➒","➓الدنانير الوهمية➓","✘ خروج ✘",}
  allccho={"➊ رفع مستوي ➊","➋ رفع مستوى النادي ➋","➌ تذاكر التنظيف ➌","➍ عملات حوض السمك ➍","➎ مطورات من الجيران ➎","➏ مستوي بيت خالد ➏","➐ طعام الأسماك ➐","➑ البقرة المليونيرة ➑","↩️ رجوع ↩️"}
Cleaning_tickets='✨ اضغط علي اختيار تلقائي قبل اختيار تذاكر التنظيف وانتظر حتي ينتهي العد ثم اضغط اختيار تلقائي مرة اخري️ ✨'
fish_tank='✨ قم بفتح حوض السمك اولاً ✨'Khaled_house='✨قم بتخزين سجادة الهالوين اولا✨'millionaire_cow='✨قم بتخزين الطاووس اولا ✨'
developer_gadgets = {'➊تحديد الكل➊','➋ طور البقرة ➋','➌ مطور الارنب ➌','➍ مطور الدجاج ➍','➎ مطور الطاووس ➎','➏ مطور الخاروف ➏','➐ الغزلان➐','➑ مطور النعامه ➑','➒ مطور الثور الفرنسي ➒','➓ مطور الديك الرومي ➓','⓫ مطور المخبز ⓫','⓬ مطور معمل الجبن ⓬','⓭مطور الطاحونة ⓭','⓮ مطور الة صنع الصلصة ⓮','⓯ مطور الة العصير ⓯','⓰ مطور الة المربى ⓰','⓱ مطور الحلوى ⓱','⓲ مطور الة السكر ⓲','⓳ مطور عصارة العنب ⓳','⓴ مطور الة باقة الزهور ⓴','❷❶ مطور الة البرغر ❷❶','❷❷ مطور الة دمى الدببة ❷❷','❷❸ مطور الة الباسطرما ❷❸','❷❹ لوح زجاجي للمختبر ❷❹','❷❺ سياج شجرة الصداقة ❷❺'," رجوع↩️ "}
codes_gadgets ={'646494694','1536','1614','1561','1832','1783','1658','1852','1760','1854','1696','1537','1559','1654','1612','1571','1660','1656','1646','1762','1644','1874','1876','1602','1531'}
--------------------------------------HOME_speed_luck(2)----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_luck ={"➊ تفعيل الحظ ➊","➋ ايقاف تفعيل الحظ ➋","➌ تفعيل التسريع ➌","➍ ايقاف التسريع ➍","➎ تفعيل الحظ منزل المأكولات ➎","➏ تركيب ملف الحظ ➏ ","➐ الغاء تركيب ملف الحظ➐"," رجوع↩️ ",}
list_seafood = {"➊ تفعيل الكل ➊","➋ أعشاب الخليج ➋","➌ أعشاب البحر ➌","➍ صدفه ➍","➎ حلزون البحر البزاق ➎","➏ مرجان ➏","➐ نجم البحر ➐","➑ أخطبوط ➑","➒ السلطعون ➒","➓ جمبري أبوسوم ➓","⓫ كابوريا الطين ⓫","⓬ الكابوريا ⓬","⓭ سلطعون مثلج ⓭","⓮ سلطعون الضفدع الأحمر ⓮"," رجوع ↩️",}
lucky_percentage={{['Code']='5011;7;500017;5',['Refine']='7;5'},{['Code']='31031;15',['Refine']='15'},{['Code']='31022;50',['Refine']='50'},{['Code']='31023;30',['Refine']='30'},{['Code']='31032;20;31027;30',['Refine']='20;30'},{['Code']='31028;30',['Refine']='30'},{['Code']='31030;20',['Refine']='20'},{['Code']='31024;50',['Refine']='50'},{['Code']='700052;10',['Refine']='10'},{['Code']='31025;40',['Refine']='40'},{['Code']='31026;6;31025;15',['Refine']='6;15'},{['Code']='31036;50',['Refine']='50'},{['Code']='31026;15',['Refine']='15'}}
---------------------------------------HOME_animals(3)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_choices={"➊ اختيار الحيوان ذكر او انثى ➊ ","➋ اخراج جميع الجيوانات ➋","➌ قائمة ملابس الحيوانات ➌","➍ تكبير الحيوانات ➍","  رجوع↩️  ",}
clothes_list=  {"➊ قائمة ملابس السلحفاة ➊","➋ قائمة نظارات الدب ➋", "➌ قائمة ملابس القط ➌","➍ قائمة القبعات ➍", "➎ قائمة ملابس الكلاب ➎","➏ قائمة ملابس القنفذ ➏"," رجوع↩️ ", }
Superfood="✨ يجب توفر طعام خارق كتير ✨"
choices_6  ={"➊ لباس رقم -1 ➊","➋ لباس رقم -2 ➋","➌ لباس رقم -3 ➌","➍ لباس رقم -4 ➍","➎ لباس رقم -5 ➎","➏ لباس رقم -6 ➏"," رجوع↩️ ",}
choices_7={"➊ لباس رقم -1 ➊","➋ لباس رقم -2 ➋","➌ لباس رقم -3 ➌","➍ لباس رقم -4 ➍","➎ لباس رقم -5 ➎","➏ لباس رقم -6 ➏","➐ لباس رقم -7 ➐" ,  " رجوع↩️ ", }
choices_3={"➊ لباس رقم -1 ➊","➋ لباس رقم -2 ➋","➌ لباس رقم -3 ➌"," رجوع↩️ ",}
choices_14={"➊ قبعة رقم -1 ➊","➋ قبعة رقم -2 ➋","➌ قبعة رقم -3 ➌","➍ قبعة رقم -4 ➍","➎ قبعة رقم -5 ➎","➏ قبعة رقم -6 ➏","➐ قبعة رقم -7 ➐","➑ قبعة رقم -8 ➑" ,"➒ قبعة رقم -9 ➒", "➓ قبعة رقم -10 ➓","⓫ قبعة رقم -11 ⓫", "⓬ قبعة رقم -12 ⓬",  "⓭ قبعة رقم -13 ⓭", "⓮ قبعة رقم -14 ⓮"," رجوع ↩️ ", }
-----------------------------------------HOME_Special_tasks(4)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
other_tasks={"➊ فتح الثلاث نجوم ➊","➋ المهام اليومية ➋","➌ جوازات السفر 0 نقود ➌","➍ المشفي ➍","➎ تصحيح الخطأ ➎","➏ المجتمع ➏","➐ فتح 3 نجوم الات الجزيرة ➐","➑ إلغاء تحميل مصانع الخردة ➑", " رجوع↩️ ", }
------------------------------------------HOME_RESORT(5)-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
resort_cods = {[' عطر اللافندر ']='30183',['اخطبوط']='700039',[ "دبس رمان "] = '600110',[' شراب البيض '] = '600154',[' شراب العنب الابيض '] = '600082',[' ديك رومي محشي '] = '600195',[' ساتاي '] = '600197',[' بيضة الشوكولاتة '] = '600207',[' معمول '] = '600138',[' ارز اللزج '] = '600163',[' حلوي التفاح بالشوكولاتة '] = '600145',[' حساء البيض '] = '600174',[' طحين الكعك '] = '600036',[' ارز بالاندومي '] = '600160',[' ستيك '] = '600107',[' ليمون ميكس '] = '600007',[' زبده '] = '600101',[' ايس كريم الهندي '] = '600074',[' عصير عنب بنكهة اليانسون '] = '600157',[' جبن قريش '] = '600183',[' بسكويت بابا نويل '] = '600139',[' تيمبور بالجزر '] = '600056',[' ديك رومي مشوي '] = '600180',[' حساء '] = '600058',[' الارز المحمص '] = '600039',[' كريب '] = '600185',[' خبز الذرة '] = '600012',[' زلابية بولندية '] = '600190',[' اندومي '] = '600055',[' بيرغة '] = '600188',[' دجاج والسمك '] = '600119',[' حليب جوز الهند '] = '600167',[' تيمبورا بالاندومي '] = '600057',[' حليب مكثف '] = '600068',[' مرقة المشمش '] = '600176',[' مهلبية ماتشا '] = '600131',[' دبس رمان '] = '600120',[' سمك حار '] = '600170',[' شراب الشعير الاسود '] = '600091',[' رقائق الذرة '] = '600227',[' صلصة تاليندية '] = '600452',[' كاب كيك الجزر '] = '600323',[' صلصة الفاصوليا بالحم '] = '600228',[' ليمون حامض مثلج '] = '600345',[' طبق ارز سوري '] = '600424',[' فقاعات الساغو '] = '600308',[' عجينة كعكة القمر '] = '600254',[' حلوي برازيلية '] = '600224',[' مهلبية جوز الهند '] = '600326',[' طبق فرنسي '] = '600284',[' سلطة البيض '] = '600212',[' معجنات الجزر '] = '600213',[' شريحة همبرغر '] = '600341',[' كعكه التفاح '] = '600290',[' قهوة عربية '] = '600372',[' ريزوتو بحلم '] = '600285',[' كاستر '] = '600467',[' بسكوت بالحليب '] = '600221',[' سلطة تون الصينية '] = '600438',[' كعكة محلاه '] = '600443',[' كاب كيك الافندر '] = '600267',[' حلوي الكاكايا '] = '600299',[' كعكة الارز '] = '600423',[' يبرق ملفوف '] = '600286',[' صلصة فاصوليا بالحم وفتات الخبز '] = '600229',[' فطيرة البطاطا '] = '600428',[' بسكوت بالقهوة '] = '600305',[' يبرق باذنجان '] = '600352',[' جبن اللافندر '] = '600306',[' عصير جرجير '] = '600365',[' فيتا '] = '600374',[' كعكة اليقطين '] = '600368',[' مكاداميا بالشوكولاتة '] = '600362',[' شريحة سجق '] = '600257',[' شاي راقي '] = '600268',[' كروس '] = '600344',[' شاي القيقب بالحليب '] = '600266',[' دجاج مقلي '] = '600249',[' طبق خضار سوري '] = '600422',[' يالنجي '] = '600433',[' التلج المجروش '] = '600240',[' معجنات الجزر المحشي '] = '600214',[' شاي جريب فروت '] = '600263',[' دجاج بالي '] = '600195',[' بولجوجي اللحم البقري  '] = '600084',[' يقطين '] = '154',[' توت شامي '] = '086',[' ورد ابيض '] = '5010',[' عنب '] = '042',[' ذرة '] = '013',[' فاكهة التنين  '] = '200008',[' باذنجان '] = '20021',[' بطيخ '] = '4010',[' فستق '] = '20006',[' التوت البري '] = '088',[' عناب '] = '084',[' قرنبيط '] = '20025',[' الزنبق '] = '5002',[' عنبية حادة '] = '7001',[' فطر '] = '9116',[' ورد احمر '] = '5006',[' اقحوان '] = '9118',[' طماطم '] = '014',[' جزر '] = '033',[' خس '] = '150',[' حبوب القهوة '] = '20027',[' سبانخ '] = '500368',[' عنب لبناني '] = '200458',[' شوفان '] = '200423',[' فاصوليا خضراء '] = '500326',['  خيار '] = '30128',['  السرخس '] = '500352',[' فاكهة قوس قزح '] = '500551',[' جوز '] = '500310',[' مكاداميا '] = '500641',[' فاكهة قلب زهري '] = '500887',[' كاجو '] = '200954',[' ت�ر اماراتي '] = '500397',[' الازوكي '] = '500537',[' لوز '] = '20152',[' البندق '] = '500355',[' عرقسوس '] = '500439',[' كستناء '] = '8003',[' افوكادو '] = '500661',[' مكسرات برازيلية '] = '500332',[' قناع الوجة بالطين '] = '32016',[' قناع الوجه بالليمون '] = '32022',[' قناع الوجه بالشوفان '] = '32018',[' قناع الوجه بالمايونيز '] = '32021',[' قناع الوجه بالورد '] = '32019',[' قناع الوجه بالحليب '] = '32020',[' كريم مصنوع يدويا '] = '501122',[' قلاده حمراء '] = '32010',[' قلب ازرق '] = '500547',[' قلادة بيضاء '] = '500546',[' دمية مخفية '] = '610002',[' لوحة رسم '] = '610003',[' زجاجة اريج خشبي '] = '610004',[' خشبة '] = '630002',[' اسطوانة خشبية '] = '630001',[' لوح خشبي '] = '630003',[' حذاء قديم '] = '700045',[' رسالة في زجاجة '] = '700046',[' حلزون البحر '] = '700025',[' حقيبة من رمل البحر '] = '700047',[' قنديل البحر '] = '700038',[' المفلطحة '] = '700015',[' باقة اللافندر '] = '200338',[' باقة توليب '] = '9109',[' باقة اقحوان '] = '9704',[' باقة ورد ابيض '] = '9108',[' باقة ورد ازرق '] = '9106',[' باقة ورد احمر '] = '9107',[' باقة زنبق '] = '9110',[' باقة ازهار وردية '] = '200231',[' باقة عباد الشمس '] = '9705',[' مارشميلو نعناع  '] = '203006',[' مارشميلو عناب  '] = '203003',[' مارشميلو اناناس '] = '203002',[' مارشميلو قوس قزح '] = '203007',[' مارشميلو خوخ '] = '203004',[' مارشميلو قهوة '] = '203001',[' مارشميلو توت بري '] = '203005',[' لبن اناناس '] = '20071',[' لبن كيوي '] = '40069',[' لبن خوخ '] = '20070',[' لبن عناب '] = '20074',[' لبن عنبية حادة '] = '40080',[' لبن بالزبيب '] = '40068',[' لبن توت شامي '] = '20073',[' لبن بطيخ '] = '20078',[' لبن شوكولاتة '] = '20077',[' ساشيمي حبار '] = '203504',[' ساشيمي اخطبوط '] = '203503',[' ساشيمي سلمون '] = '203501',[' ساشيمي سلطعون '] = '203505',[' ساشيمي ماكريل '] = '203506',[' ساشيمي سكلوب '] = '203502',[' دمية البكة '] = '300015',[' دمية دب ازرق '] = '300014',[' دمية الحصان  '] = '300016',[' دمية دب احمر  '] = '300013',[' كيوي مجفف '] = '11505',[' عنبية حاده مجففة '] = '11501',[' موز مجفف '] = '11509',[' فراولة مجففة '] = '11508',[' زبيب مجفف '] = '11502',[' اناناولة مجففة '] = '11507',[' ليمون مجفف '] = '11506',[' كوسا مجففة '] = '11503',[' كاكايا مجففة '] = '11504',[' قهوة موكا '] = '20046',[' موكا بيضاء '] = '65010',[' زيت زهرة البنفسج '] = '11210',[' زيت اقحوان '] = '11203',[' زيت ورد ازرق '] = '11206',[' زيت الشاي '] = '11201',[' زيت ورد احمر '] = '11205',[' زيت اللافندر '] = '11202',[' زيت زنبق '] = '11209',[' زيت زهرة العسل '] = '11207',[' زيت توليب '] = '11208',[' زيت زهرة عباد الشمس '] = '11211',[' زيت بابونج '] = '11204',[' لباس قطني '] = '11703',[' ملابس صوفية '] = '079',[' حرير '] = '11702',[' قماش كتان '] = '11701',[' حلوي العنب '] = '20191',[' حلوي البرتقال '] = '20195',[' حلوي خوخ '] = '20197',[' حلوي العناب '] = '20193',[' حلوي فراولة '] = '20192',[' حلوي التفاح '] = '20194',[' حلوي موز '] = '20196',[' قبعه '] = '200332',[' قبعة ريش النعام '] = '200330',[' قبعة ريش الاوز  '] = '200329',[' قبعة ريش الطاووس '] = '200328',[' حلوي التيراميسو '] = '65016',[' كعكة جوز الهند '] = '30100',[' كعكة الليمون '] = '30099',[' كعكة اللوز '] = '30098',[' كعكة الحب  '] = '65017',[' كعكة الموز  '] = '200339',[' كعكة الشوكولاتة بالكرز '] = '30097',[' فطيرة فراوله '] = '9004',[' فطيرة عناب '] = '9003',[' فطيرة يقطين '] = '9104',[' فطيرة الشوكولاتة '] = '9703',[' فطيرة ثمرة الحب '] = '9702',[' فطيرة خوخ '] = '9701',[' خبز القرفة '] = '11106',[' خبز الاناناولة '] = '11109',[' خبز الكوسا '] = '11104',[' خبز الزبيب '] = '11101',[' خبز عنبية '] = '11105',[' خبز الثوم '] = '11103',[' خبز الكيوي '] = '11108',[' خبز الفراولة '] = '11107',[' سلة ورد ابيض '] = '11803',[' سلة زهرة العسل '] = '11804',[' سلة الياسمين '] = '11805',[' سلة زنبق '] = '11802',[' سلة بابونج '] = '11801',[' سلة زهرة وردية '] = '11807',[' سلة زهرة البنفسج '] = '11806',[' عصير عنب '] = '200466',[' عصير عنب اخضر '] = '200003',[' عصير تفاح '] = '200467',[' عصير مانجو '] = '200469',[' عصير عنب معتق '] = '044',[' عصير عنب لبناني '] = '200459',[' برغر الديك الرومي '] = '200710',[' برغر الخضروات '] = '500002',[' برغر اللحم '] = '200709',[' برغر جبن '] = '500001',[' هوت دوج تركي '] = '65013',[' لحم هوت دوج '] = '30142',[' صندل الفراشة '] = '203202',[' صندل النرجس '] = '203203',[' صندل الالبكة '] = '203205',[' صندل بغباء '] = '203201',[' شيكولاتة اللوز '] = '200571',[' شيكولاتة الفستق '] = '200572',[' شيكولاتة بالكرز '] = '200573',[' شوكولاتة الزبيب '] = '200570',[' عطر الورد الازرق '] = '30185',[' عطر الزنبق '] = '30188',[' عطر التوليب '] = '30187',[' عطر الورد الاحمر '] = '30186',[' عطر زهرة الربيع  '] = '30184',[' صابون توليب '] = '203106',[' صابون بابونج '] = '203102',[' صابون بالعسل '] = '203105',[' صابون زهرة البنفسج '] = '203108',[' صابون ورد احمر '] = '203104',[' صابون غار '] = '203101',[' صابون عباد الشمس '] = '203107',[' سجق البقر '] = '30095',[' سجق لحم غزال '] = '20015',[' سجق لحم الخنزير '] = '52003',[' بسطرمة الديك الرومي '] = '65014',[' فوشار بالشوكولاتة '] = '200359',[' فوشار بالسكر  '] = '200360',[' عسل '] = '046',[' حليب '] = '017',[' حليب جاموس '] = '30130',[' ريش اوز '] = '30134',[' ريش نعام '] = '20144',[' ريش طاووس '] = '6002',[' بيض '] = '021',}
list_resort = {'➊🔍 ابحث 🔎➊','➋ تحويل برسيم حجازي الى قرون ➋','➌ تحويل القرون الى برسيم حجازي ➌','➍ تحويل برسيم حجازي لزيادة النقاط  ➍','➎ تحويل مواد النقاط الى قرون ➎','➏🔍 سجل البحث 🔎➏','رجوع ↩️',} all = 'اختيار الكل' delet='❎ مسح السجل ❎' back = 'رجوع ↩️' stop= '⛔ ايقاف ⛔' error_search = '❎البحث خطأ❎' 
point_resort = {'➊ إخطبوط ➊','➋ مفكات ➋','➌ حجر اساس الذهب ➌','➍ طبق أطعمة رأس السنة ➍','➎ طبق يبرق باذنجان ➎','➏ طبق إسباغتي مع الحبار ➏',' رجوع↩️ '}
-------------------------------------------HOME_BUY(6)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_buy = {'➊ أسماك ➊','➋ تحصيل ➋','➌ منتجات بالفيزا ➌','➍ منتجات مطورات ➍','➎ منتجات الجزيرة ➎','➏ منتجات الآلات المغلقة ➏','➐ اعادة الضبط لشراء منتجات آخري ➐',' رجوع↩️ '}
fishes ={['اذان البحر '] = '700075',['مرجان'] = '700036',['اعشاب الخليج'] = '700041',['جمبري عملاق'] = '700077',['ماكريل'] = '700021',['جمبري السرعوف'] = '700029',['اعشاب البحر '] = '700042',['سلطعون الضفدع الاحمر '] = '700034',['الكابوريا'] = '700033',['صدفة'] = '700024',['اخطبوط'] = '700039',['حلزون البحر البزاق'] = '700026',['سمك صدفي'] = '700074',['السلطعون'] = '700028',['سلطعون مثلج'] = '700076',}
rare_p ={[' بيضة القرن']= '41055',['بتلة خيزران'] = '41061',['ريشة يونيكورن'] = '41081',['ريش النحام الوردي'] = '41057',['مخمل رنة الاحتفال'] = '41085',['ريش فينكس'] = '41083',['قدم ديك الرومي'] = '41079',['شعر حصان عيد الحب'] = '41087',['حليب غزال المحظوظ'] = '41073',['كعكة الفطائر المنفوخه الزهره الزرقاء'] = '207801',['كعكة الفطائر المنفوخه الزهره الحمراء'] = '207802',['كعكة الفطائر المنفوخه بالصباره'] = '207803',['كعكة الفطائر المنفوخه بالزنبق'] = '207804',['كعكة الفطائر المنفوخه بزهره السوسن'] = '207805',['كعكة الفطائر المنفوخه بلوميريا'] = '207806'}
lucky_p={['جلد ثور فرنسي'] = '22070',['جزر بلاستيك'] = '22038',['باقة زهور مجففة'] = '22074',['عصير فرنسي'] = '22046',['طبق فواكة'] = '22034',['صلصة ميكس'] = '22050',['جبن زرقاء'] = '22002',['دمية الغزال'] = '22058',['حليب بودرة'] = '22001',['ريشة طاووس اسود'] = '22082',['لحم نعامة سوداء'] = '22085',['جلد نعامة سوداء'] = '22088',['برغر صغير'] = '22042',['جلد رقيق'] = '22078',['خبز فرنسي'] = '22066',['ريش دجاج'] = '22025',['مصاصة'] = '22062',['مهلبية شامية'] = '22029',['علف'] = '22024',['دبس سكر'] = '22054',['فرو مخمل '] = '22037',['بيض احمر'] = '22023',}
island_p={['حجر قرميد'] = '610008',['انبوب ماء'] = '610009',['مراه تجميل'] = '610006',['نشارة خشب '] = '630005',['دمية مخفية'] = '610002',['صندوق انقاذ حيوان'] = '611002',['لوحة رسم زيتية'] = '610003',['قرون'] = '610015',['اسطوانة خشبية'] = '630001',['خشب ساندرز'] = '8021',['برميل بارود'] = '619004',['خشب البلوط'] = '8013',['خشبة'] = '630002',['قنبلة'] = '619003',['خشب الارز'] = '8017',['لوح خشبي'] = '630003',['ديناميت'] = '619002',['بارود'] = '619001',['أوراق التوت'] = '8009',['قرن وحيد القرن']= '610015',['تاج ذهبي']='3034',['علبة تجميل'] = '610005',['زجاج اريج خشبي'] = '610004',['مطاط'] = '8032',['خيزران'] = '8005',['كستناء'] = '8003',}
special_p={['الكمأة بيضاء'] = '501152',	['جرجير'] = '500655',	['حنطة سوداء'] = '500836',	['عدس'] = '500765',	['كافيار أسود'] = '500776',	['اوراق الخيزران'] = '501166',	['كزبرة'] = '500714',	['السمسم'] = '501397',	['بصل اخضر'] = '500989',	['قبار '] = '500631',	['خميرة'] = '500139',	['شمندر احمر '] = '501286',	['رواند'] = '500564',	['فلفل الحار'] = '501066',	['بط مشوي'] = '501246',	['فانيلا'] = '500466',	['خل ابيض'] = '30221',	['بقدونس'] = '501082',	['الهيل'] = '501609',	['طحين صودا'] = '500623',	['ريحان'] = '500826',	['براعم البقوليات'] = '500846',	['ثوم معمر'] = '501587',['قطرم'] = '500816',}
locked_p={['فوشار بزبدة الفستق'] = '200531', ['دمية الطاووس'] = '300018', ['قهوة قيقب'] = '65022', ['قهوة هاواي'] = '65023', ['قهوة الكرز'] = '65024', ['شوكولاتة بالموز'] = '200574', ['شوكولاتة بالتين'] = '200575', ['شوكولاتة بالمشمش'] = '200576',['قهوة كريمة'] = '65011'}
---------------------------------------------HOME_PALANtS(7)---------------------------------------------------------------------------------
cultivation = {"➊ اوراق برسيم الاربعة ➊","➋ جواهر الذرة الزجاجي ➋","➌ يقطين والطماطم ➌","➍ فلفل هاينان ➍","➎ فول محمص ➎","➏ فطر المارشملو ➏","➐ بطيخ المحبة ➐","➑ تفاح سوري ➑","➒ كرز سوريناني ➒","➓ رامبوتان ➓","⓫ ليمون الماسية ⓫","⓬ بذور الخوخ ⓬","⓭ أجاص اسيوي⓭","⓮ زيتون كريستالي ⓮","⓯ البوط ⓯","⓰ بندورة ⓰","✰ رجوع↩️ ✰",}
cafe = "✨ قم باختيار زرع حبوب القهوة ثم اختار نوع الزرع ✨"
ananola = '✨ قم باختيار زرع الأناناولة قبل اختيار البندورة ✨'
------------------------------------------------------------------------------------------------------------------------------------------
fake1 = {"➊دنانير وتلقائي من المصنع➊ " , "➋دنانير وهمي من الهدايا➋", "  رجوع ↩️ "}
fakea = "✨قم بفتح المصنع اولا ثم قم بالدمج✨"
fakeB = "✨قم بالتحديد علي الطاقة قبل البحث✨"
-----------------------------------------------HOME (9)----------------------------------------------------------------------------------------------
Help_menu = {"➊ روابط مساعدة للتهكير ➊","➋ بعض اكواد المزرعة ➋", "  رجوع ↩️ ",} 
Urls_name = {"➊ المزرعه الاصدار الأخير 7.8.100 ➊","➋ جيم جاردن ELNGOME ➋","➌ جيم جاردن الرسمي اخر اصدار ➌","➍ ملف الشامل ELNGOME ➍","➎ قريبا ➎", "➏ اF1 لاندرويد ١٣ ➏","➐ جاجا اندرويد ١٢ و ١٣ ➐","➑ ساند اندرويد ١٢ ➑","➒ اللانشر ➒","➓ ساند اندرويد 11 ➓","⓫ الساند لاندرويد 7حتي11 ⓫","⓬ الجاجا ⓬","⓭ فيموس اندرويد 12 ⓭", "⓮ روم فيموس ⓮ ", "⓯ اداه تفعيل فيموس ⓯", "⓰ متجر Apkpure  لتحديث المزرعه ⓰","⓱ المستكشفes ⓱","⓲ المستكشفMT ⓲","⓳ اClone app pro ⓳ ", "⓴ الفرس التلقائي اوتو كليكر ⓴", "❷❶ اوتو كليكر ❷❶", "❷❷ انقر مساعد اوتو كليكر ❷❷","❷❸ اVMOS unlocker ❷❸", "  رجوع↩️ "}
MAchine={["اله تشورو"] = "207700",["اله الهوت دوج"] = "30141",["اله الحساء"] = "207600",["اله الكيشمي"] = "30222",["اله شوي السمك "] = "30300",["اله سله الزهور "] = "11800",["اله القهوه "] = "20045",["اله البيتزا "] = "20090",["اله السكر "] = "20123",["اله السميط"] = "207300",["اله خبز الزنجبيل "] = "207400",["اله الدفء "] = "206200",["اله العلكه"] = "206700",["اله الحبوب"] = "206400",["اله الوافل"] = "206800",["اله نحت الرمل"] = "205800",["اله ذبادي مثلج"] = "206300",["اله التاكو"] = "205900",["اله النودلز "] = "206900",["اله الثلج المجروش"] = "207000",["اله الكاب كيك"] = "206600",["االه قناع الهالوين"] = "207200",["اله نحت الجليد "] = "207500",["صانع بتله الزهره"] = "205500",["اله صنداي "] = "205700",["اله معكرونه سريعه التحضير"] = "205600",["اله الماكرون "] = "205400",["اله حلوه الدب"] = "205300",["اله صنع رقائق  البطاطس"] = "204900",["اله الدونات"] = "205000",["اله دولاب السباحه"] = "205100",["صانع زي الهالوين"] = "205200",["اله شموع معطره"] = "206000",[" اله البالون"] = "204300",["اله الصودا"] = "204700",[" اله القلي"] = "204600",["صانعه بأن كيك"] = "204800",["مصن� سانتا"] = "204500",["موقد القرميد التقليدي"] = "204400",["اله المعلبات "] = "204200",}
Animals={	["الحصان"] ="52000",["الفيل "] ="41038",["القرد "] = "41040",	["ماعز دمشقي"] = "20037",["ثور فرنسي"] = "20112",["الالبكه "] = "20126",	["النعامه"] = "20140",	["ديك رومي"] = "20143",["الخاروف الاحمر "] = "4004",	["الطاوووس"] = "6001",["رومى أبيض"] = "20143",	["الرنه"] = "14000",["الخروف الدمشقي"] = "41052",	["الجاموس"] = "200325",["النحام الوردى"] = "41056",	["الكيباء"] = "41058",	["الحمار الوحشي"] = "41074",	[" اوز أسود العنق"] = "41067",}
Masar={	["مسار النزهات"] ="1008",["بركة ماء"] ="39999",["بركة شاطئ"] = "40002",	["مسار حصاة"] = "590015",["مسار خشبى"] = "590016",["مسار الغابة"] = "590128",	["صخرة مع زهرة"] = "590174",["مسار الماكرون"] = "590194",["مسار زراعى"] = "598001",	["مسار قرميدى"] = "598002",["مسار ثلجى"] = "598003",	["مسار الكريسماس"] = "598004",	["حوض حليب خارق"] ="80003",["اناء الجبن الخارق"] ="80103",["وعاء طحين خارق"] = "80203",	["وعاء بيض خارق"] = "80303",["وعاء عصير خارق"] = "80503",["وعاء جزر خارق"] = "80603",	["وعاء برغر خارق"] = "80622",["قالب عصارة خارق"] = "80642",["وعاء صلصة خارق"] = "80662",	["وعاء سكر خارق"] = "80682",["حاوية لحم الغزلان"] = "80702",	["حاوية الحلوي الخارق"] = "80722",["حاوية الخبز الخارق"] = "80742",}
Thare={	["بوط"] ="7046",["بندورة"] ="7048",	["ورد ابيض"] = "5009",	["توفى التفاح"] = "7084",	["زهره ورديه"] = "200227",	["اللافندر"] = "30072",	["جزر"] = "32",	["ورقه حلوه"] = "7090",	["فراوله"] = "132",	["باميه"] = "7078",	["باشن فروت"] = "7054",	["نبات عشبى"] = "7052",	["الفجل"] = "7074",	["عنب لبنانى"] = "200457",	["زنبق يومى"] = "7124",	["نبات اوريو"] = "7060",	["فستق"] = "20005",	["فاكهه الشر"] = "7100",	["بصل"] = "9119",	["قرنبيط"] = "20024",	["صبار"] = "7094",	["عناب"] = "83",	["زهره الحب"] = "300003",	["التوليب"] = "5003",	["الزنبق"] = "5001",	["ورد احمر"] = "5005",	["بطاطا"] = "147",	["زهره الاشباح المقدسه"] = "7122",	["توت شامى"] = "85",	["اناناس"] = "4007",	["حلوى الهيكل العظمى"] = "7082",	["سبانخ"] = "500567",	["اقحوان"] = "9117",	["فول"] = "20000",	["زنبق الوادى"] = "7126",	["الكيوى الذهبى"] = "7092",	["عباد الشمس"] = "9121",	["مفرقع المهرجان"] = "7088",	["توت برى"] = "87",	["شوفان"] = "200422",	["نجمه الحظ"] = "7086",	["عنب اخضر"] = "200001",	["فاكهه فرانكشتاين"] = "7102",	["الذره"] = "13",	["الخس"] = "149",	["كرات"] = "7096",	["باذنجان"] = "20020",	["بطيخ"] = "4006",	["بتله خيزران"] = "7064",	["زهره الربيع الورديه"] = "50026",	["حبوب القهوه"] = "20026",	["زهره السوسن"] = "50036",	["الخردل"] = "7072",	["فلل جالابينو"] = "7108",	["يقطين"] = "153",	["ورد ازرق"] = "5007",	["سله حلوى الهالوين"] = "7120",	["فاصوليا خضراء"] = "500325",	["قمح"] = "3",	["برسيم"] = "4",	["شمندر سكرى"] = "200527",	["الهندباء"] = "7056",	["عنب"] = "41",	["كرفس"] = "7080",	["نخاله"] = "65002",	["بطاطا حلوه"] = "9123",	["طماطم"] = "2",	["قطن"] = "20022",	["فطر"] = "9114",	["فلفل احمر"] = "151",	["عشب"] = "20028",	["ملفوف"] = "500147",	["ثمره الحب"] = "9411",	["كاكاو"] = "7110",	["خيار"] = "30127",	["فطر الشبح"] = "7062",	["الرخس"] = "500351",	["زهره اللوتس"] = "30145",	["قصب"] = "20121",	["زنجبيل"] = "7076",	["زهره البالون"] = "7058",	["بوط"] = "7046",	["يقطين الهالوين"] = "500176",	["فاكهه التين"] = "200007",	["الارز"] = "6003",}
Mokhtpr={	["ليمون الماسية"] = "5115",	["رامبوتان"] = "5113",	["بذور الخوخ"] = "5123",	["تفاح سوري "] = "5109",	["كرز سوريناني"] = "5111",	["زيتون كريستالي"] = "5127",	["اجاص اسيوي"] = "5125",	["اوراق البرسيم الاربعة"] = "5101",	["فول محمص"] = "5117",	["بطيخ المحبة"] = "5121",	["اليقطين والطماطم"] = "5105",	["جواهر الذرة زجاجي"] = "5103",	["فلفل هاينان"] = "5107",	["فطر المارشملو"] = "5119",}
Fa={["اله الوافل"] = "206800",	["الطاوووس"] = "6001"}Yellow_ak= {"➊ تحصيل ➊","➋ اسماك ➋","➌ خشب ومتفجرات ➌","➍ منتجات فيزا ➍","➎ منتجات عشوائي ➎","➏ بيت الاسماك والتجميل ➏","➐ جزيرة ➐","  رجوع ↩️ ",}
th1={	["الكمأة بيضاء"] = "501152",	["جرجير"] = "500655",	["حنطة سوداء"] = "500836",	["عدس"] = "500765",	["كافيار اسود"] = "500776",	["اوراق الخيزران"] = "501166",	["كزبرة"] = "500714",	["السمسم"] = "501397",	["بصل اخضر"] = "500989",	["قبار "] = "500631",	["خميرة"] = "500139",	["شمندر احمر "] = "501286",	["رواند"] = "500564",	["فلفل الحار"] = "501066",	["بط مشوي"] = "501246",	["فانيلا"] = "500466",	["خل ابيض"] = "30221",	["بقدونس"] = "501082",	["الهيل"] = "501609",	["طحين صودا"] = "500623",	["ريحان"] = "500826",	["براعم البقوليات"] = "500846",	["ثوم معمر"] = "501587",	["قطرم"] = "500816",}fishes1 = {	["حلزون البحر البزاق"] = "700026",	["سمك صدفي"] = "700074",	["السلطعون"] = "700028",	["اذان البحر "] = "700075",	["ماكريل"] = "700021",	["جمبري السرعوف"] = "700029",	["اعشاب البحر "] = "700042",	["سلطعون الضفدع الاحمر "] = "700034",	["الكابوريا"] = "700033",	["صدفة"] = "700024",	["اخطبوط"] = "700039",	["مرجان"] = "700036",	["اعشاب الخليج"] = "700041",	["جمبري عملاق"] = "700077",	["سلطعون مثلج"] = "700076",}  khshb1={	["خشب البلوط"] = "8013",	["خشبة"] = "630002",	["قنبلة"] = "619003",	["اسطوانة خشبية"] = "630001",	["خشب الارز"] = "8017",	["خشب ساندرز"] = "8021",	["برميل بارود"] = "619004",	["لوح خشبي"] = "630003",	["ديناميت"] = "619002",}
shhn1={ ["فوشار زبدة الفستق"] = "200531",["كعكه الفطائر المنفوخه الزهره الزرقاء"]= "207801",	["كعكه الفطائر المنفوخه الزهره الحمراء "] = "207802",	["كعكه الفطائر المنفوخه بالصباره"] = "207803",	["كعكه الفطائر المنفوخه بالزنبق"] = "207804",	["كعكه الفطائر المنفوخه بزهره السوسن"] = "207805",		["كعكه الفطائر المنفوخه بلوميريا"] = "207806",	[" بيضة القرن"]= "8013",	["بتلة خيزران"] = "41061",	["ريشة يونيكورن"] = "41081",	["ريش النحام الوردي"] = "41057",	["مخمل رنة الاحتفال"] = "41085",	["ريش فينكس"] = "41083",	["ريش اوز اسود العنق"] =  "41077",}
mtwer1={	["بسطرمة لحم"] = "22101",	["دمية خالد "] = "22097",["حليب بودرة"] = "22001",	["ريشة طاووس اسود"] = "22082",	["لحم نعامة سوداء"] = "22085",	["جلد نعامة سوداء"] = "22088",	["برغر صغير"] = "22042",	["جلد رقيق"] = "22078",	["خبز فرنسي"] = "22066",	["ريش دجاج"] = "22025",	["مهلبية شامية"] = "22029",	["علف"] = "22024",	["دبس سكر"] = "22054",	["فرو مخمل "] = "22037",	["بيض احمر"] = "22023",	["جلد ثور فرنسي"] = "22070",	["جزر �لاستيك"] = "22038",	["باقة زهور مجففة"] = "22074",	["عصير فرنسي"] = "22046",	["طبق فواكة"] = "22034",	["صلصة ميكس"] = "22050",	["جبن زرقاء"] = "22002",	["دمية الغزال"] = "22058",	["مصاصة"] = "22062",}
gthera1={["صابون غار"] = "203101",["صابون بابونج"] = "203102",["صابون ورد احمر"] = "203104",["صابون بالعسل"] = "203105",["صابون توليب"] = "203106",["صابون عباد الشمس "] = "203107",["صابون بنفسج"] = "203108",["ساشيمي  سكلوب"] = "203502",["ساشيمي اخطبوط "] = "203503",["ساشيمي حبار"] = "203504",["ساشيمي ماكريل"] = "203506",["سله بابونج "] = "11801",["سله زنبق"] = "11802",["سله ورد ابيض"] = "11803",["سله زهره العسل"] = "11804",["سله الياسمين"] = "11805",["سله زهره البنفسج "] = "11806",["سله زهره ورديه"] = "11807",["خبز الزبيب"] = "11101",[" خبز الثوم"] = "11103",["خبز كوسا"] = "11104",["خبز عنيبه حاده"] = "11105",["خبز بالقرفه"] = "11106",["خبز الفراولة "] = "11107",["خبز كيوي"] = "11108",["خبز انانوله"] = "11109",["خبز بالكاكايا"] = "11110",	["انبوب ماء"] = "610009",	["مطاط"] = "8023",	["خيزران"] = "8005",	["كستناء"] = "8003",	["قرون"] = "610015",	["بارود"] = "619001",	["مراه تجميل"] = "610006",	["نشارة خشب "] = "630005",	["دمية مخفية"] = "610002",	["لوحة رسم زيتية"] = "610003",	["علبة تجميل"] = "610005",	["زجاجة اريج خشبي"] = "610004",	["حجر قرميد"] = "610008",["صندوق انقاذ حيوان"] = "611002",["أوراق التوت"] = "8009",}
tgmil1={["الاسكالوب المجفف"] = "31005",["محاره"] = "31006",["حلزون البحر "] = "31007",["لحم جمبري"] = "31008",["جمبري السرعوف علي البخار "] = "31009",["جمبري ابو سوم علي البخار"] = "31010",["سلطعون الطين علي البخار"] = "31011",["سلطعون علي البخار"] = "31012",["سلطعون الضفدع الأحمر المطبوخ"] = "31013",["بودر المرجان"] = "31014",["نجم البحر المجفف "] = "31015",["قنديل البحر المملح"] = "31016",["لحم الاخطبوط"] = "31017",["مسحوق الطحالب"] = "31018",["أعشاب بحريه مطبوخه "] = "31019",["طحالب بحريه جافه"] = "31020",["خس البحر المطبوخ"] = "31021",["لؤلؤ"] = "31022",["قوقعه حلزون البحر "] = "31023",["كرات الجمبري"] = "31024",["ستيك سلطعون "] = "31025",["بطارخ سلطعون "] = "31026",["غصن مرجان"] = "31027",["بيض نجم البحر "] = "31028",["مرقعه الحبر"] = "31030",["صلصال الطحالب"] = "31031",["شرائح مرجان"] = "31032",["صدف اذن البحر"] = "31033",["جمبري ضخم علي البخار"] = "31034",["سلطعون مثلج علي البخار "] = "31035",["سلطعون  لازق"] = "31036",["قلاده حمراء"] = "32010",["قلاده المحار"] = "32011",["قلاده  اللؤلؤ"] = "32012",["قرط الأذن بالصدف"] = "32013",["قرط الأذن ريشه الطاؤس"] = "32014",["قرط الأذن ريشه الاوز"] = "22015",["قناع الوجه بالطين"] = "32016",["قناع الوجه بالاعشاب البحريه"] = "32017",["قناع الوجه بالشوفان"] = "32018",["قناع الوجه بالورد"] = "32019",["قناع الوجه بالحليب"] = "32020",["قناع الوجه بالمايونيز"] = "32021",["قناع الوجه  باليمون"] = "32022",["قناع الوجه  المرجاني "] = "32023",["قناع الوجه بالموز"] = "32024",["مراه علي شكل قنديل البحر "] = "32025",["مراه  ورد ماجاني"] = "32026",["مراه الؤلؤ "] = "32027",["خاتم الورد"] = "500389",["اكليل الغار"] = "500410",["قرط اذن الحب"] = "500412",["زجاجه اريج شجره الشاي"] = "32028",["قلاده الريش "] = "500452",["زجاجه اريج  لافندر "] = "32029",["زجاجه اريج بابونج"] = "32030",["زجاجه اريج زهره العسل"] = "32031",["زجاجه اريج الزنبق"] = "32032",["زجاجه اريج  زهره  البنفسجي"] = "32033",["اكليل بلومريا"] = "500517",["قلاده بيضاء"] = "500546",["قلب ازرق"] = "500547",["قلاده زجاجيه"] = "500548",["قناع افوكادو"] = "500666",["كريم زيتون الوجه"] = "500676",["صابون الاجاص ليد"] = "500798",["مرهم  شفاه بنكهه الجوافه"] = "500935",["كريم مصنوع يدويا"] = "501122",}
Urls = {"https://family-farm.ar.uptodown.com/android/download", "https://www.mediafire.com/file/1h434ode5zr92h1/GG-%25D9%2581%25D8%25B1%25D9%258A%25D9%2582_%25D8%25A7%25D9%2584%25D9%2586%25D8%25AC%25D9%2588%25D9%2585_V2.0.apk/file"," https://www.mediafire.com/download/b5mjmtbuv9ibs6h",  "https://www.mediafire.com/file/i5b3kitpj5tr7b3/ELNGOME_23.lua/file"," قريبا رابط ملف الاكواد","https://51down.51mnq.com/a/f1vm-v1.3.1.3.07-64gpfn-gp-release-withrom-202207141614.apk", "https://www.mediafire.com/file/9i7t0o1emmzravd/vphonegaga_for_Android_12%252613.apk/file", "https://x8files-1251460295.file.myqcloud.com/a/x8sandbox-v0.7.6.2.09-64gp-gp-release-withrom-202202231128.apk",  "https://x8files-1251460295.file.myqcloud.com/a/x8_51_android12_helper1.4.2.apk",  " https://www.mediafire.com/file/ikwiu6fqu1%20lwxrs/X8_SANDBOX_0.7.6.0.04_LITE_%20VIP(Aspectre).apk/file", "https://www.mediafire.com/file/osh449xtam80v2f/x8sandbox-v0.7.5.6.03-64gp-gp-release-withrom-202104021540.apk/file", "https://www.mediafire.com/download/i8xbi2p372q3j1f"," https://www.mediafire.com/file/tow5h9ue4msba1a/VMOS_Pro_v1.7.0-PRM.apk/file", "https://www.mediafire.com/file/8noynzb3a4fgn5s/MagiskRoot%252BXposed%252BGApp-64bit_%257BREC_ROM%257D.zip/file","https://www.vmos.cn/zhushou.htm ", "https://m.apkpure.com/apkpure/com.apkpure.aegon/download","https://www.mediafire.com/download/fkbu0k27czsapgp", "https://www.mediafire.com/download/2xzjbxg5lvnk40t",  "https://www.mediafire.com/download/ccr4wzi39sy3l4y", " https://www.mediafire.com/download/wp22v1a84cdqko2", "https://www.mediafire.com/download/70lq51z7jru4bl4",   " https://www.mediafire.com/download/149kku4innpyxq2","https://apkcombo.com/ar/vmos-unlocker/com.vmos.adclient", }
cod = {"➊🔎تعديل 🔍➊","➋ كود اله المهمة ➋","➌ كود الالات ➌","➍ كود الحيوانات ➍","➎ المسارات وقطع المطورات ➎","➏ كود منتجات بالاصفر ➏","➐ كود مزروعات المختبر ➐"," ✰ رجوع ↩️ ✰"}
cod1= {"➊🔎 محرك البحث 🔍➊","➋ كود اله المهمة ➋","➌ كود الالات ➌","➍ كود الحيوانات ➍","➎ المسارات وقطع المطورات ➎","➏ كود منتجات بالاصفر ➏","➐ كود مزروعات المختبر ➐"," رجوع ↩️ ",}

------------------------------------------HOME---------------------------------------------
function HOME()
gg.setVisible(false)
elngoom = gg.choice(elngooom,nil,hh)
if elngoom == nil then  else
if elngoom==1 then HOME_ALL() end
if elngoom==2 then speed_luck()end
if elngoom==3 then animals()end
if elngoom==4 then special_tasks() end
if elngoom==5 then resort() end
if elngoom==6 then buy() end
if elngoom==7 then plants() end
if elngoom==8 then NG() end
if elngoom==9 then HOME9() end
if elngoom==10 then fake() end
if elngoom==11 then Exit() end
end
ex(0) 
  end
  ------------------------------------HOME_ALL(1)-----------------------------------------
function HOME_ALL()
gg.setVisible(false)
allcho = gg.choice(allccho,nil,hh)
if allcho == nil then ex(1) end
if allcho == 1 then NOGOM("Q'size_y'",1,nil,10000,'0',1,nil,1,1) end
if allcho == 2 then club_level() end
if allcho == 3 then gg.alert(Cleaning_tickets)NOGOM('300;20',64,'20',300,'300',1,1,1,1) end
if allcho == 4 then gg.lert(fish_tank) NOGOM('80;600;1800',4,nil,300,'0',1,nil,1,1) end
if allcho == 5 then developer() end
if allcho == 6 then gg.alert(Khaled_house)  NOGOM('50000;5;1',4,'1',10000,'1000',1,1,1,1) NOGOM("Q'size_y'",1,nil,10000,'0',1,nil,1,1) gg.alert(' ✨قم بشراء ورص سجاد الهالويين✨ ' )end
if allcho == 7 then  NOGOM('200;1000',4,'1000',300,'9999999',1,1,1,1) NOGOM('200;1200',4,'1200',300,'9999999',1,1,1,1) end
if allcho == 8 then gg.alert(millionaire_cow) NOGOM('6001',4,nil,300,'590048',1,nil,1,1) end
if allcho == 9 then HOME () end

ex(1) 
 end
 -------------مستوي النادي---------------
function club_level()
gg.setVisible(false)	
level_club= gg.prompt({'📆 أدخل عدد ايام أيام الدخول 📆',},{'📆number days📆'},{'text'})
 if level_club ==nil then HOME()
 else NOGOM(  level_club[1],32,    nil,     9999,    '999999',1,nil,1,1)end
end
------------طلب مطورات من الجيران--------
function developer ()
gg.setVisible(false)
	gadgets_ch = gg.multiChoice(developer_gadgets,nil,hh)
if gadgets_ch == nil then else 
if gadgets_ch[1] then
	   for j = 2, 25 do
	      gadgets_ch[j] = true
	   end
	end
	for i = 2, 25 do
	   if gadgets_ch[i]then
		NOGOM(codes_gadgets[i],64,nil,300,'15',1,nil,1,1)
       end
	end
    if gadgets_ch[26] then HOME_ALL() end
end
end
---------------------------------------HOME_speed_luck(2)----------------------------------------------------
function speed_luck()
	gg.setVisible(false)
   speedo_luck = gg.choice(list_luck,nil,hh)
if speedo_luck == nil then ex(2) end
if speedo_luck == 1 then gg.unrandomizer(0)end
if speedo_luck == 2 then gg.unrandomizer(nil,nil,nil,nil) end
if speedo_luck == 3 then gg.setSpeed(3.6)end
if speedo_luck == 4 then gg.setSpeed(1.0)end
if speedo_luck == 5 then seafood()end
if speedo_luck == 6 then file_luck()end
if speedo_luck == 7 then rm_file_luck()end
if speedo_luck == 8 then HOME() end
ex(2)
end
------------منزل المأكولات--------------
function seafood()
	gg.setVisible(false)
local seafood_list
seafood_list = gg.multiChoice(list_seafood,nil,hh)
if seafood_list == nil then else end
     if seafood_list [15] == true  then  end
     if seafood_list [1] == true then
          for i = 1,#lucky_percentage
             do 
                SeaFoodAll(i) 
          end
     end
     for i = 1, #lucky_percentage
        do
         if seafood_list [i+1] == true then 
              SeaFoodAll(i)
         end
    end
end
function SeaFoodAll(index)NOGOM(lucky_percentage[index].Code,64,lucky_percentage[index].Refine,300,"100",1,1,1,1)end

---------تركيب ملف الحظ----------
function file_luck() 
	gg.setVisible(false)
alldata= (gg.makeRequest('https://drive.google.com/uc?export=download&id=1080KzhYgahcEwp-K_Vib4iTlAeWRM8IA').content)
	file = io.open("/data/data/com.funplus.familyfarm/Resources/scripts/common/util.lua", "wb")
	file:write(alldata)
	io.close(file)
colse () 
end
---------حذف ملف الحظ---------
function rm_file_luck() 
	gg.setVisible(false)
os.remove("/data/data/com.funplus.familyfarm/Resources/scripts/common/util.lua")
colse () 
end

----------------------------------HOME_animals(3)-----------------------------------------------------------
function animals ()
	gg.setVisible(false)
choices = gg.choice(list_choices,nil,hh)
if choices == nil then ex(3) end
if choices  == 1  then NOGOM('81001~81033;1::60',64,'1',9999,'0',1,1,1,1) end
if choices  == 2  then NOGOM('1E;1072693248D;3D;1175D::17',64,'1',9999,'2',1,1,1,1) end
if choices  == 3  then m3() end
if choices  == 4  then gg.alert(Superfood) NOGOM('161;50',64,'50',9999,'0',1,1,1,1) end
if choices  == 5 then HOME() end
ex(3)
end
------------------------
function m3()gg.setVisible(false)
choices = gg.choice(clothes_list,nil,hh)
if choices == nil then ex(3) end 
if choices  ==  1 then mm1() end
if choices  ==  2 then mm2() end
if choices ==   3 then mm3() end
if choices  ==  4 then mm4() end
if choices  ==  5 then mm5() end
if choices  ==  6 then mm6() end
if choices  ==  7 then animals() end
ex(3)
end
-------------------------------------------------------------------- 
function mm1 ()gg.setVisible(false)
mo = gg.choice(choices_6,nil,hh)
if mo == nil then ex(3)end 
if mo  ==1  then NOGOM('83002',64,nil,1700,'86004',1,nil,1,1) end
if mo  == 2 then NOGOM('83002',64,nil,1700,'86005',1,nil,1,1) end
if mo  == 3 then NOGOM('83002',64,nil,1700,'86006',1,nil,1,1) end
if mo  == 4 then NOGOM('83002',64,nil,1700,'86007',1,nil,1,1) end
if mo  == 5 then NOGOM('83002',64,nil,1700,'86008',1,nil,1,1) end
if mo  == 6 then NOGOM('83002',64,nil,1700,'86009',1,nil,1,1) end
if mo  == 7 then m3() end
ex(3)
end
---------------------------------------------------------------------------------
function mm2()gg.setVisible(false)
oo = gg.choice(choices_6,nil,hh)
if oo == nil then ex(3) end
if oo  == 1  then NOGOM('83002',64,nil,1700,'87006',1,nil,1,1) end
if oo  == 2  then NOGOM('83002',64,nil,1700,'87007',1,nil,1,1) end
if oo  == 3  then NOGOM('83002',64,nil,1700,'87008',1,nil,1,1) end
if oo  == 4  then NOGOM('83002',64,nil,1700,'87009',1,nil,1,1) end
if oo  == 5  then NOGOM('83002',64,nil,1700,'87010',1,nil,1,1) end
if oo  == 6  then NOGOM('83002',64,nil,1700,'87011',1,nil,1,1) end
if oo  == 7  then m3()end
ex(3)
end
-----------------------------------------------------------------------
function mm3()gg.setVisible(false)
oo = gg.choice(choices_7,nil,hh)
if oo == nil then ex(3) end
if oo  == 1  then NOGOM('83002',64,nil,1700,'85003',1,nil,1,1) end
if oo  == 2  then NOGOM('83002',64,nil,1700,'85004',1,nil,1,1) end
if oo  == 3  then NOGOM('83002',64,nil,1700,'85005',1,nil,1,1) end
if oo  == 4  then NOGOM('83002',64,nil,1700,'85006',1,nil,1,1) end
if oo  == 5  then NOGOM('83002',64,nil,1700,'85007',1,nil,1,1) end
if oo  == 6  then NOGOM('83002',64,nil,1700,'85008',1,nil,1,1) end
if oo  == 7  then NOGOM('83002',64,nil,1700,'85009',1,nil,1,1) end
if oo  ==  8  then m3() end
ex(3)
end
-----------------------------------------------------------
function mm4()gg.setVisible(false)
o1o = gg.choice(choices_14,nil,hh)
if o1o == nil then ex(3) end
if o1o  == 1  then NOGOM('83002',64,nil,1700,'85002',1,nil,1,1) end
if o1o  == 2  then NOGOM('83002',64,nil,1700,'85003',1,nil,1,1) end
if o1o  == 3  then NOGOM('83002',64,nil,1700,'85004',1,nil,1,1) end
if o1o  == 4  then NOGOM('83002',64,nil,1700,'85005',1,nil,1,1) end
if o1o  == 5  then NOGOM('83002',64,nil,1700,'85006',1,nil,1,1) end
if o1o  == 6  then NOGOM('83002',64,nil,1700,'85007',1,nil,1,1) end
if o1o  == 7  then NOGOM('83002',64,nil,1700,'85008',1,nil,1,1) end
if o1o  == 8  then NOGOM('83002',64,nil,1700,'85009',1,nil,1,1) end
if o1o  == 9  then NOGOM('83002',64,nil,1700,'85010',1,nil,1,1) end
if o1o  == 10 then NOGOM('83002',64,nil,1700,'85011',1,nil,1,1) end
if o1o  == 11 then NOGOM('83002',64,nil,1700,'85012',1,nil,1,1) end
if o1o  == 12 then NOGOM('83002',64,nil,1700,'85013',1,nil,1,1) end
if o1o  == 13 then NOGOM('83002',64,nil,1700,'85014',1,nil,1,1) end
if o1o  == 14 then NOGOM('83002',64,nil,1700,'85015',1,nil,1,1) end
if o1o  ==15 then m3() end
ex(3)
end
------------------------------------------------------------------------------
function mm5()gg.setVisible(false)
oo = gg.choice(choices_7,nil,hh)
if oo == nil then ex(3) end
if oo == 1 then NOGOM('83002',64,nil,1700,'84004',1,nil,1,1) end
if oo == 2 then NOGOM('83002',64,nil,1700,'84005',1,nil,1,1) end
if oo == 3 then NOGOM('83002',64,nil,1700,'84006',1,nil,1,1) end
if oo == 4 then NOGOM('83002',64,nil,1700,'84007',1,nil,1,1) end
if oo == 5 then NOGOM('83002',64,nil,1700,'84008',1,nil,1,1) end
if oo == 6 then NOGOM('83002',64,nil,1700,'84009',1,nil,1,1) end
if oo == 7  then m3() end
ex(3)
end
----------------------------------------------------------
function mm6()gg.setVisible(false)
oo = gg.choice(choices_3,nil,hh)
if oo == nil then ex(3) end
if oo  ==1  then NOGOM('83002',64,nil,1700,'88004',1,nil,1,1) end
if oo  ==2  then NOGOM('83002',64,nil,1700,'88005',1,nil,1,1) end
if oo  ==3  then NOGOM('83002',64,nil,1700,'88006',1,nil,1,1) end
if oo  ==4  then m3() end
ex(3)
end
----------------------------------------HOME_special_tasks(4)----------------------------------------------------------

function special_tasks()gg.setVisible(false)
speci = gg.multiChoice(other_tasks,nil,hh)
if speci == nil then ex(4)end
if speci[1] == true then NOGOM('1E;3E;2E;20E;4E;5E;6E;14E::999',64,'1',100,'0',1,1,1,1) end
if speci[2] == true then daily_tasks() end
if speci[3] == true then NOGOM('467D;1E::5',64,'1',100,'0',1,1,1,1)NOGOM('36;162;1095',64,nil,100,0,1,nil,1,1)end
if speci[4] == true then NOGOM('3E;49285D::13',64,'3',300,'4',1,1,1) end
if speci[5] == true then NOGOM('1030006',4,nil,300 ,'1030005', 1,nil,1,1)end 
if speci[6] == true then NOGOM('1;10;60',64,'1',100,'0',1,1,1,1) end
if speci[7] == true then NOGOM('80;600;1800',4,nil,100,'0',1,nil,1,1) end
if speci[8] == true then factories() end
if speci[9] == true then HOME() end
ex(4)
end
---------- المهام اليومية
function daily_tasks()
	gg.setVisible(false)
if file_exists("/data/data/com.funplus.familyfarm/Resources/scripts/daily_quest/data.lua") then 
if not file_exists("/data/data/com.funplus.familyfarm/Resources/scripts/vip/elngome.txt") then 
	urls={'https://drive.google.com/uc?export=download&id=1muVeBhsN9X1rARMfMhj6VBRz4mwf2Q6i', 'https://drive.google.com/uc?export=download&id=1myyxA4jrR8Tyok04uWHvPu2gzpC80MTP', 'https://drive.google.com/uc?export=download&id=1n4DvrSA-JI7kfSj0yac7mXQNLUnV7uQu', 'https://drive.google.com/uc?export=download&id=1n6M8SwU5D9o-SO3cuoftT2FExL2tDwZJ', }
	files={"/data/data/com.funplus.familyfarm/Resources/scripts/daily_quest/data.lua", "/data/data/com.funplus.familyfarm/Resources/scripts/daily_quest/questCell.lua", "/data/data/com.funplus.familyfarm/Resources/scripts/daily_quest/controller.lua", "/data/data/com.funplus.familyfarm/Resources/scripts/daily_quest/launcher.lua", }
	for i=1, #urls do
	    getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		io.close(file)
	end
	file = io.open("/data/data/com.funplus.familyfarm/Resources/scripts/vip/elngome.txt", "wb")
	file:write("Done")
    io.close(file)
    colse () 
end
end
NOGOM("27000~27099E;1~2000E",64, "1~2000",500,"0",1,1,1,1)
end

-------------الغاء تحميل المصانع
function factories()
if file_exists("/data/data/com.funplus.familyfarm/Resources/scripts/production_house/controller.lua") then 
getalldata= (gg.makeRequest('https://drive.google.com/uc?export=download&id=1mp-cQr2Pe8PgXYoRSwKNBm4r16Gr0snc').content)
	file = io.open("/data/data/com.funplus.familyfarm/Resources/scripts/production_house/controller.lua", "wb")
	file:write(getalldata)
	io.close(file)
	colse () 
end
end


-----------------------------------------------HOME_RESORT(5)---------------------------------------------------------------


function resort ()gg.setVisible(false)
file = io.open('Stars.txt', 'a')
resort_ch = gg.choice(list_resort,nil,hh)
if resort_ch == nil then ex(5)  end
if resort_ch == 1 then resort_1 () end
if resort_ch == 2 then NOGOM('7025',64,nil,1700,'610015',1,nil,1,1) end 
if resort_ch == 3 then NOGOM('610015',64,nil,1700,'7025',1,nil,1,1) end
if resort_ch == 4 then point() end
if resort_ch == 5 then point_convert() end
if resort_ch == 6 then resort_2 ()end
if resort_ch == 7 then HOME () end
ex(5)
end

gg.setVisible(false)gg.setVisible(false)
function resort_1 () 
	gg.setVisible(false)
	gg.sleep(1500)
input = gg.prompt({'✰ 🔍اسم المنتج🔎 ✰'},{'دخلت متسول هتطلع ملياردير  🤑🤑'},{'text'})
	if input ==nil then
		resort() end
	names = {}
	codes={}
	for k,v in pairs(resort_cods) do
		 if string.find(k,input[1]) then 
		    table.insert(names, '✰ '..k..' ✰')
		    table.insert(codes, k)
			table.sort(names)
			table.sort(codes)
		end
	end
	if next(names) == nil then
		gg.toast('✰ '..error_search..' ✰')gg.setVisible(false)
		gg.sleep(800)
		resort_1 () end
	table.insert(names,   '✰ '..back..' ✰')gg.setVisible(false)
	names_ch = gg.multiChoice(names,nil,hh)
	if names_ch == nil then 
	gg.sleep(500) resort_1 () end
	if names_ch[#names] then
		resort () end
	favs={}
	for i=1 , #names do
	   if names_ch[i] then
		  if not names_ch[#names] then
			  file:write(codes[i],'\n')
		  end
		NOGOM(resort_cods[codes[i]],64,nil,1700,'7025',1,nil,1,1)      
       end
    end
gg.sleep(500)
resort_1 ()
end

function resort_2 ()     gg.setVisible(false)
     function file_exists(file)
	  local f = io.open(file, 'rb')
	  if f then f:close() end
	  return f ~= nil
	end
    lines_alt ={}
	function lines_from(file)
	  if not file_exists(file) then return {} end
	  local lines = {}
	  for line in io.lines(file) do 
	    lines[#lines + 1] = '✰ '..line..' ✰'
	    lines_alt[#lines_alt + 1] = line
	  end
	  return lines
	end

	local file = 'Stars.txt'
	local lines = lines_from(file)
	table.insert(lines , '✰ '..all..' ✰')
	table.insert(lines_alt,'✰ '..all..' ✰')
	rev = {}
	rev_alt ={}
	for i=#lines, 1, -1 do
		rev[#rev+1] = lines[i]
		rev_alt[#rev_alt+1] = lines_alt[i]
	end
	lines = rev
	lines_alt = rev_alt
	table.insert(lines , '✰ '..delet..' ✰')
	table.insert(lines , '✰ '..back..' ✰')
	last_search=gg.multiChoice(lines,nil,hh)
	if last_search == nil then
		resort ()
	end
	if last_search[1] then
	     for i=2,#lines-2 do
	        if lines[i] == '✰ '..stop..' ✰' then  break end
            last_search[i] = true 
	     end
	     last_search[1] = false
	end
	stop_number = {}
    for i=1,#lines do
	  if lines[i] == '✰ '..stop..' ✰' then  table.insert(stop_number, i) end
    end
--    print(stop_number)
    for j=1, #stop_number do
		if last_search[stop_number[j]] then
		     for i=stop_number[j]+1 ,#lines-2 do
		        if lines[i] == '✰ '..stop..' ✰' then  break end
	            last_search[i] = true 
		     end
		end
	end
	not_deleted ={}
	 if last_search[#lines - 1] then
		for i=2, #lines do
			if i == #lines-1 then
				break
			end
			if not last_search[i] then
				table.insert(not_deleted, lines_alt[i])
			end
		end
		file = io.open('Stars.txt', 'w+')
       for i=#not_deleted, 1, #lines do
          file:write(not_deleted[i], '\n') 
       end
		io.close(file)
	else
		for i=1,#lines do
			if last_search[#lines] then
				resort ()
			end
			if last_search[i]==true then
				NOGOM(resort_cods[lines_alt[i]],64,nil,1700,'7025',1,nil,1,1)
			end
		end
    end
resort ()
end

function point ()gg.setVisible(false)
resort_point = gg.choice(point_resort,nil,hh)
if resort_point == nil then ex(5)  end
if resort_point == 1 then NOGOM('7025',64,nil,1700,'700039',1,nil,1,1) end 
if resort_point == 2 then NOGOM('7025',64,nil,1700,'620006',1,nil,1,1) end 
if resort_point == 3 then NOGOM('7025',64,nil,1700,'610012',1,nil,1,1) end
if resort_point == 4 then NOGOM('7025',64,nil,1700,'600418',1,nil,1,1) end 
if resort_point == 5 then NOGOM('7025',64,nil,1700,'600352',1,nil,1,1) end
if resort_point == 6 then NOGOM('7025',64,nil,1700,'600124',1,nil,1,1) end 
if resort_point == 7 then resort () end
ex(5)
end

function point_convert()
codCon ={'700039','620006','610012','600418','600352','600124'}
for i=1 ,#codCon do
NOGOM(codCon[i],64,nil,1700,'610015',1,nil,1,1)
end 
end

------------------------------------------HOME_BUY(6)-------------------------------------------------------------------------------------------------
function REVERT_SEARCH(rev) 
  gg. setValues(rev)
end

function action ( arr ) 
       list={}
      selected ={}
	   for k, v in pairs(arr) do
			table.insert(list, k) 
		end
		table.sort(list)
		table.insert(list, ' رجوع↩️ ')
	    BE = gg.multiChoice(list, nil,hh) 
	    ch_list={} 
	     if BE == nil then
	        ex()
	     end
	     if BE[#list] then
	           buy ()
	     end
	    for i=1, #list-1 do
			if BE[i] then
			   table.insert(ch_list,  arr[list[i]]) 
			end
		end
	    for i=1, #ch_list do
		     if ch_list[i] then table.insert(selected, i) end
        end
      g=asd1
	  d=asd2
	  s=asd3
	  gg.alert("🔥قم فتح موقد الطهي واختار وصفة معكرونه بالجبن 🔥")
	  gg.setVisible(false)
	  gg.searchNumber(g ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  if #selected == 1 then
	     gg.refineNumber("3" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  else
	     gg.refineNumber(d ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	 end
	  rev = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
	  revv_t = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
	  gg.editAll(999999, gg.TYPE_DOUBLE)
	  gg.clearResults()
	  gg.setVisible(false)
      gg.searchNumber("18;999999" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  gg.refineNumber("18" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
      revv2 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	  revv2_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	  gg.editAll(ch_list[selected[1]], gg.TYPE_DOUBLE)
	  gg.clearResults()
	  revv3=revv2_t
	   if #selected > 1 then
	    gg.setVisible(false)
	    gg.searchNumber("20;999999" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    gg.refineNumber("20" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    revv3 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	    revv3_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	   gg.editAll(ch_list[selected[2]], gg.TYPE_DOUBLE)
	   gg.clearResults()
	   end
end
    asd1 = "18;3;20;2"
    asd2 = "3;2"
    asd3 = "18;999999;20;999999"
function buy()
gg.setVisible(false)
tc2p_ch = gg.choice (list_buy,nil,hh)
if tc2p_ch == nil then ex(6)  end
if tc2p_ch == 1 then action (fishes) end
if tc2p_ch == 2 then action (special_p) end
if tc2p_ch == 3 then action (rare_p) end
if tc2p_ch == 4 then action (lucky_p) end
if tc2p_ch == 5 then action (island_p) end
if tc2p_ch == 6 then action (locked_p) end
if tc2p_ch == 7 then REVERT_SEARCH(revv_t)  REVERT_SEARCH(revv2_t)  REVERT_SEARCH(revv3)end
if tc2p_ch == 8 then HOME() end
ex(6)
end


--------------------------------------------HOME_PALANtS(7)----------------------------------------------------------------------------------------------------------


function plants()gg.setVisible(false)
gg.alert(cafe)
lib = gg.choice(cultivation,nil,hh)
if lib == nil then ex(7)end
if lib==1  then NOGOM ('20026',4,nil,2000,'5101',1,nil,1,1) end
if lib==2  then NOGOM ('20026',4,nil,2000,'5103',1,nil,1,1) end
if lib==3  then NOGOM ('20026',4,nil,2000,'5105',1,nil,1,1) end 
if lib==4  then NOGOM ('20026',4,nil,2000,'5107',1,nil,1,1) end 
if lib==5  then NOGOM ('20026',4,nil,2000,'5117',1,nil,1,1) end 
if lib==6  then NOGOM ('20026',4,nil,2000,'5119',1,nil,1,1) end 
if lib==7  then NOGOM ('20026',4,nil,2000,'5121',1,nil,1,1) end
if lib==8  then NOGOM ('20026',4,nil,2000,'5109',1,nil,1,1) end
if lib==9  then NOGOM ('20026',4,nil,2000,'5111',1,nil,1,1) end
if lib==10 then NOGOM ('20026',4,nil,2000,'5113',1,nil,1,1) end
if lib==11 then NOGOM ('20026',4,nil,2000,'5115',1,nil,1,1) end
if lib==12 then NOGOM ('20026',4,nil,2000,'5123',1,nil,1,1) end
if lib==13 then NOGOM ('20026',4,nil,2000,'5125',1,nil,1,1) end
if lib==14 then NOGOM ('20026',4,nil,2000,'5127',1,nil,1,1) end
if lib==15 then NOGOM ('20026',4,nil,2000,'7046',1,nil,1,1) end
if lib==16 then gg.alert (ananola)NOGOM ('7014',4,nil,2000,'7048',1,nil,1,1) end
if lib==17 then HOME() end
ex(7)
end 
-----------------------------------------HOME(8)--------------------------------------------------------------------------------------------------------------------------------------
gg.setVisible(false)

function NG()
 PASSSW = gg.prompt({"🔐 Enter Password 🔐:-"},{[1]=" 🔐 Password 🔐"},{[1]="text"})
if PASSSW == nil then gg.alert ('🔐Enter Password🔐') 
elseif PASSSW[1] == "" then gg.alert(" 🔐Enter Password🔐") HOME()
 elseif PASSSW[1] == "zain" then gg.alert("🔓correct password☺️️")
NOGOM('h6C696D69745F636F6E6669675F6E6577',1,nil,10000,'0',1,nil,1,1) 
NOGOM('30001',4,nil,300,'15',1,nil,1,1) 
else gg.alert("🔒Incorrect password😭") end HOME ()
end
-------------------------------------------------------------------------------
function fake()
 typ = gg.choice(fake1,nil,hh)
 if typ == nil then HOME() end
 if typ==1  then gg.alert(fakea) NOGOM ('590352;5',64,'5',17000,'-1000000',1,1,1,1) NOGOM ('41038;41040',64,nil,17000,'400009;74',1,nil,1,1) NOGOM ('590352;590353',64,nil,17000,'400009;74',1,nil,1,1) end
 if typ==2  then gg.alert(fakeB) NOGOM (':600027',1,nil,17000,':400009',1,nil,1,1) end
 if typ==3 then HOME() end
end
-------------------------------------------HOME(9)------------------------------------------------------------------------------------------------------------------------


function HOME9() gg.setVisible(false)
gg.toast("♡تمت الاضافة بمساعدة وابداع♡ \n     ♡ محمد صلاح ♡  ")
help_menu= gg.choice(Help_menu, nil,hh) 
	if help_menu == nil then ex(9) end
	if help_menu == 1 then help_menu_1() end
	if help_menu == 2 then help_menu_2() end
	if help_menu == 3 then HOME() end
	ex(9)
end

function help_menu_1()gg.setVisible(false)

   codes = gg.choice( Urls_name ,nil,hh) 
	if codes==nil then
	   HOME9()
	end
	     if codes==#Urls_name then
		   HOME9()
		     end
		--print(urls[codes])
	gg.copyText(Urls[codes])
	gg.toast("✔تم نسخ الرابط بنجاح✔")
	--os.exit()
end

function help_menu_2()

function get_index(arr, word)
	for index, item in ipairs(arr) do
	      if item == word then
		    return index
		  end
	end
end

function compareByStringLength(a, b)
  return #a > #b
end

function split_array(farray, array_1,array_2)
   for k, v in pairs(farray) do
      table.insert(array_1, k) 
      table.insert(array_2, v)
   end
end


function generateItems (arr1, arr2, ashta)gg.setVisible(false)
   local items = {}
   for i=1, #arr1 do
      table.insert(items, "✮"..arr1[i].."✮")
   end
   table.insert(items, " ✰ رجوع↩️ ✰") 
   return items
end
function sa_ad(ar1, ar2, nem)
    ar1= {}
    ar2= {}
    split_array(nem,ar1,ar2)
    arr1 = ar1
	arr2 = {}
	table.sort(arr1, compareByStringLength)
	for i=1, #arr1 do
	   table.insert(arr2, nem[arr1[i]])
	end
end
function categories()
	codes = gg.choice( generateItems(arr1, arr2,"✮🔍محرك البحث🔍✮"
	) , nil,hh) 
	taken = ""
	
	if codes==nil then
	   HOME9() 
    elseif codes== #generateItems(arr1, arr2,"") then help_menu_2() 
	
	  else
 taken = arr2[codes]
	   gg.copyText(arr2[codes])
   end
end

function categories_edit()
   codes = gg.choice( generateItems(arr1, arr2,"✮⌨تعديل⌨✮") , nil,hh) 
	taken_edit = ""
	if codes==nil then
	   HOME9() 
	end
	   taken_edit = arr2[codes]
	   gg.copyText(arr2[codes])
	
end
function home()
yellow_ak= gg.choice(Yellow_ak, nil,hh) 
end

arr1 = {}
arr2 = {}
test = gg.choice(cod1 , nil,hh) 
if test==nil then HOME9() end
if test == 1 then  end
if test == 2 then fa=Fa sa_ad(fa_1, fa_2, fa) categories()end
if test == 3 then Machine2=MAchine sa_ad(Machine2_1, Machine2_2, Machine2) categories()end
if test == 4 then animals=Animals sa_ad(animals_1,animals_2,animals) categories() end
if test == 5 then masar=Masar sa_ad(masar_1,masar_2,masar) categories() end
if test == 7 then mokhtpr=Mokhtpr sa_ad(mokhtpr_1,mokhtpr_2,mokhtpr) categories() end
if test== 8 then HOME9()  end
 if test == 6 then home() 
 if yellow_ak == nil then ex(9)end
 if yellow_ak == 1 then  so=th1 sa_ad(so_1,so_2,so) categories() end
 if yellow_ak == 2 then  fishes2=fishes1 sa_ad(fishes2_1,fishes2_2,fishes2) categories() end
 if yellow_ak == 3 then  khshb2=khshb1 sa_ad(khshb2_1,khshb2_2,khshb2) categories() end
 if yellow_ak == 4 then shhn2=shhn1 sa_ad(shhn2_1,shhn2_2,shhn2) categories() end
 if yellow_ak == 5 then  mtwer2=mtwer1 sa_ad(mtwer2_1,mtwer2_2,mtwer2) categories() end
 if yellow_ak == 6 then tgmil2=tgmil1 sa_ad(tgmil2_1,tgmil2_2,tgmil2) categories() end
 if yellow_ak == 7 then gthera2=gthera1 sa_ad(gthera2_1,gthera2_2,gthera2) categories() end
 if yellow_ak == 8 then  help_menu_2() end 
 end
gg.clearResults()
search = gg.prompt({"🔍ابحث بالكود🔎"},{[1]=taken},{[1]='number'})
if not search the﻿n help_menu_2() end 
taken = search[1]
search_code = ""
search_type = gg.alert("✮برجاء اختيار نوع البحث✮","[✮DWORD✮]","[✮DOUBLE✮]","[✮الغاء✮]")
if search_type == nil then
   HOME9()
elseif search_type == 1 then
   search_code = 4
elseif search_type == 2 then
   search_code = 64
else
   help_menu_2() 
end
gg.setVisible(false)
gg.searchNumber(search[1] , search_code, false, gg.SIGN_EQUAL, 0, -1, 0)
ref = 0
search_action = gg.alert("     ☟                                                                 ☟                     ☟","[✮تعديل✮]","[✮اعادة بحث✮]","[✮الغاء✮]")
if search_action == nil then
   help_menu_2() 
   elseif search_action == 3 then 
   help_menu_2() 
elseif search_action == 1 then 
   
elseif search_action == 2 then
   ref = 1

   search_refine = gg.prompt({"🔄كود اعاده البحث🔄"},{[1]=taken},{[1]='number'})
   if not search_refne the﻿n help_menu_2() end 

end

if ref ==1 then gg.refineNumber(search_refine[1] ,search_code,false,536870912,0,-1,0) end
local res = gg.getResults(gg.getResultsCount(), nil, nil, nil, nil, nil, nil, nil, nil)
test = gg.choice( cod , nil,hh) 
if test==nil then help_menu_2() end
if test == 1 then  end
if test == 2 then fa=Fa sa_ad(fa_1, fa_2, fa) categories_edit()end
if test == 3 then Machine2=MAchine sa_ad(Machine2_1, Machine2_2, Machine2) categories_edit()end
if test == 4 then animals=Animals sa_ad(animals_1,animals_2,animals) categories_edit() end
if test == 5 then masar=Masar sa_ad(masar_1,masar_2,masar) categories_edit() end
if test == 7 then mokhtpr=Mokhtpr sa_ad(mokhtpr_1,mokhtpr_2,mokhtpr) categories_edit() end
if test== 8 then HOME9()  end
 if test == 6 then home() 
 if yellow_ak == nil then help_menu_2()end
 if yellow_ak == 1 then  so=LANG.th sa_ad(so_1,so_2,so) categories_edit() end
 if yellow_ak == 2 then  fishes2=fishes1 sa_ad(fishes2_1,fishes2_2,fishes2) categories_edit() end
 if yellow_ak == 3 then  khshb2=khshb1 sa_ad(khshb2_1,khshb2_2,khshb2) categories_edit() end
 if yellow_ak == 4 then shhn2=shhn1 sa_ad(shhn2_1,shhn2_2,shhn2) categories_edit() end
 if yellow_ak == 5 then  mtwer2=mtwer1 sa_ad(mtwer2_1,mtwer2_2,mtwer2) categories_edit() end
 if yellow_ak == 6 then tgmil2=tgmil1 sa_ad(tgmil2_1,tgmil2_2,tgmil2) categories_edit() end
 if yellow_ak == 7 then gthera2=gthera1 sa_ad(gthera2_1,gthera2_2,gthera2) categories_edit() end
 if yellow_ak == 8 then  help_menu_2() end 
 end
search_edit = gg.prompt({"🚫كود التعديل🚫"},{[1]=taken_edit},{[1]='number'})
if not search_edit the﻿n help_menu_2() end 
gg.editAll(search_edit[1], search_code)
gg.clearResults()
--else
gg.toast("✰تم التعديل✰")end
   
  --end

-----------------------------------------------------------------------------------------------------------
  function ex (z)gg.setVisible(false)
	THSH = -1
	gg.skipRestoreState()
	gg.setVisible(false)
    while true do
	    if gg.isVisible(true) then
		    THSH = 1
		    gg.setVisible(false)
	    end
	    if THSH == 1 then
	        gg.setVisible(true)
		    if z ==1 then HOME_ALL()
		    elseif z == 2 then speed_luck()
		    elseif z == 3 then animals()
		    elseif z == 4 then special_tasks()
		    elseif z == 5 then resort()
		    elseif z == 6 then buy()
		    elseif z == 7 then plants()
		    elseif z == 8 then NG()
		    elseif z == 9 then HOME9()
		    else
	           HOME ()
	       end
	    end
	 end
end
function file_exists(file)
	  local f = io.open(file, "rb")
	  if f then f:close() end
	  return f ~= nil
	end
function Exit()
gg.setVisible(true)
print("__________u$$$$$$$$$$$$$$$$$$$u__________")
print("_________u$$$$$$$$$$$$$$$$$$$$$u_________")
print("_______u$$$$$$$$$$$$$$$$$$$$$$$$u_______")
print("_______u$$$$$$$$$$$$$$$$$$$$$$$$u_______")
print("_______u$$$$$$”___”$$$”___”$$$$$$u________")
print("_______”$$$$”______u$u_______$$$$”________")
print("________$$$u______u$$$u______u$$$________")
print("_________”$$$$uu$$$___$$$uu$$$$”_________")
print("__________”$$$$$$$”___”$$$$$$$”__________")
print("____________u$$$$$$$u$$$$$$$u____________")
print("_____________u$”$”$”$”$”$”$u______________")
print("__uuu________$$u$_$_$_$_$u$$_______uuu__")
print("_u$$$$________$$$$$u$u$u$$$_______u$$$$_")
print("__$$$$$uu______”$$$$$$$$$”_____uu$$$$$$__")
print("u$$$$$$$$$$$uu____”””””____uuuu$$$$$$$$$$")
print("$$$$”””$$$$$$$$$$uuu___uu$$$$$$$$$”””$$$”")
print("_”””______””$$$$$$$$$$$uu_””$”””___________")
print("___________uuuu_””$$$$$$$$$$uuu___________")
print("__u$$$uuu$$$$$$$$$uu_””$$$$$$$$$$$uuu$$$__")
print("__$$$$$$$$$$””””___________””$$$$$$$$$$$”__")
print("___”$$$$$”______________________””$$$$””__")
 gg.skipRestoreState()
  os.exit()

end 
function colse () 
colse=gg.alert('✨قم باغلاق المزرعة ✨','✨تاكيد✨','✨لاحقا✨')
if colse == nil then HOME() end
if colse == 1 then gg.processKill()end
if colse == 2 then HOME() end
end
while true do
  if gg.isVisible(true) then
    ES = 1
    gg.setVisible(false)
  end
  gg.clearResults()
  if ES == 1 then
    HOME()
  gg.toast("تٌــــــــــ ✰فُريَّّقُ هِّکَْر آلََنٌِجَّوٌُمًِـ✰ ــــــــــم")
 end
 end
 
 
-- END SCRIPT -- 
