local path = gg.EXT_STORAGE
local GameInfo=gg.getTargetInfo()
local DownloadPath = path .. "/Download/"
local currentPackage = gg.PACKAGE

friday = {"عن أوس بن أوسٍ رضي الله عنه،  قَالَ: قالَ رسولُ اللَّه ﷺ: إنَّ مِن أَفْضلِ أيَّامِكُمْ يَوْمَ الجُمُعةِ، فَأَكْثِرُوا عليَّ مِنَ الصلاةِ فِيهِ، فإنَّ صَلاتَكُمْ معْرُوضَةٌ علَيَّ فقالوا: يَا رسول اللَّه، وكَيْفَ تُعرضُ صلاتُنَا عليْكَ وقدْ أرَمْتَ؟ قال: يقولُ: بَلِيتَ، قالَ: إنَّ اللَّه حَرم عَلَى الأرْضِ أجْساد الأنْبِياءِ.\nرواهُ أَبُو داود بإسنادٍ صحيحِ","عنْ عبداللَّه بن عمرو بن العاص، رضي اللَّه عنْهُمَا أنَّهُ سمِع رسُول اللَّه ﷺ يقُولُ: مَنْ صلَّى عليَّ صلاَةً، صلَّى اللَّه علَيّهِ بِهَا عشْرًا.\nرواهُ مسلم","قال رسول الله ﷺ: (إِذَا كَانَ يَوْمُ الجُمُعَةِ، كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ المَسْجِدِ المَلاَئِكَةُ، يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ، فَإِذَا جَلَسَ الإِمَامُ طَوَوُا الصُّحُفَ، وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ).\nرواه البخاري، في صحيح البخاري، عن أبي هريرة",}
------------------------------------------HOME----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hh = {"╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰═════════✬☞ѕтαяѕ тєαм☜✬═════════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰════════✬☞S͢t͢a͢r͢s͢ T͢e͢a͢m͢☜✬════════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰════════✬☞S҉t҉a҉r҉s҉ T҉e҉a҉m҉☜✬════════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰══════✬☞S͓̽t͓̽a͓̽r͓̽s͓̽ T͓̽e͓̽a͓̽m͓̽☜✬══════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰════════✬☞₴₮₳Ɽ₴ ₮Ɇ₳₥☜✬════════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰════✬☞⟅S⟆⟅t⟆⟅a⟆⟅r⟆⟅s⟆ ⟅T⟆⟅e⟆⟅a⟆⟅m⟆☜✬════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝","╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰════════✬☞S̐t̐a̐r̐s̐ T̐e̐a̐m̐☜✬════════✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝"}
elngooom ={"『1』【 القسم الشامل📂 】","『2』【 قسم الحظ والتسريع 📂 】","『3』【 قسم الحيوانات الأليفة 📂 】","『4』【 قسم التفعيلات الخاصة 📂 】","『5』【 قسم شراء منتجات بنقود صفراء  📂 】","『6』【 قسم زرع المختبر 📂 】","『7』【 تبديل المزارع 📂 】","『8』【 متجر تطبيقات  📂 】","『9』【 قسم VIP  📂 】","✘ خروج ✘"} search_again = "‼️ لم يتم العثور علي نتائج بحث ... قم بإعادة البحث 🔁"
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------HOME_All(1)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
allccho={"『1』〘  المطورات من الجيران 📂 〙","『2』〘  الوهمي 📂 〙","『3』〘  رفع المستوى 📝 〙","『4』〘  زيادة طعام الأسماك 📝 〙","『5』〘  تذاكر التنظيف 📝 〙","『6』〘  رفع مستوى بيت خالد 📝 〙","『7』〘  عملات حوض السمك 📝 〙","『8』〘  البقرة المليونيرة 📝 〙"," ↩️ رجوع ↩️ "} Cleaning_tickets='📃 اضغط علي اختيار تلقائي قبل اختيار تذاكر التنظيف وانتظر حتي ينتهي العد ثم اضغط اختيار تلقائي مرة اخري️' Khaled_house='?? قم بتخزين سجادة الهالوين اولاً' donekhaledHouse=' ✨ قم بشراء ورص سجاد الهالويين ✨ ' fish_tank='📃 قم بفتح حوض السمك اولاً' millionaire_cow='📃 قم بتخزين الطاووس اولاً'
-------------------------------------- Developer ----------------------------------
developer_gadgets = {'『1』〘  تحديد الكل 📝 〙','『2』〘   مطور البقرة  📝 〙','『3』〘   مطور الارنب  📝 〙','『4』〘  مطور الدجاج   📝 〙','『5』〘 مطور الطاووس   📝 〙','『6』〘 مطور الخاروف   📝 〙','『7』〘 مطور الغزلان   📝 〙','『8』〘 مطور النعامه 📝 〙','『9』〘 مطور الثور الفرنسي 📝 〙','『10』〘 مطور الديك الرومي 📝 〙','『11』〘 مطور المخبز 📝 〙','『12』〘 مطور معمل الجبن 📝 〙','『13』〘 مطور الطاحونة الجبن 📝 〙','『14』〘 مطور الة صنع الصلصة 📝 〙','『15』〘 مطور الة العصير 📝 〙','『16』〘 مطور الة المربى 📝 〙','『17』〘 مطور الحلوى 📝 〙','『18』〘 مطور الة السكر 📝 〙','『19』〘 مطور عصارة العنب 📝 〙','『20』〘 مطور الة باقة الزهور 📝 〙','『21』〘 مطور الة البرغر 📝 〙','『22』〘 مطور الة دمى الدببة 📝 〙','『23』〘 مطور الة الباسطرما 📝 〙','『24』〘 لوح زجاجي للمختبر 📝 〙','『25』〘 سياج شجرة الصداقة 📝 〙'," رجوع↩️ "}
codes_gadgets ={'646494694','1536','1614','1561','1832','1783','1658','1852','1760','1854','1696','1537','1559','1654','1612','1571','1660','1656','1646','1762','1644','1874','1876','1602','1531'}
------------------------------------- Fake Dananer --------------------------------
fake1 = {"『1』〘 دنانير وتلقائي من المصنع 📝 〙","『2』〘 دنانير وهمي من الهدايا 📝 〙"," رجوع ↩️ "} fakea = "📃 قم بفتح المصنع اولا ثم قم بالدمج" fakeB = "📃 قم بالتحديد علي الطاقة قبل البحث"
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------HOME_speed_luck(2)----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_luck ={"『1』〘 تفعيل الحظ منزل المأكولات 📂 〙","『2』〘 تفعيل الحظ 📝 〙","『3』〘 ايقاف تفعيل الحظ 📝 〙","『4』〘 تفعيل التسريع 📝 〙","『5』〘 ايقاف التسريع 📝 〙","『6』〘 تسريع المنطاد 📝 〙","『7』〘 تركيب ملف الحظ 📝 〙"," رجوع↩️ ",} msgSpeed=''
list_luck_rm ={"『1』〘 تفعيل الحظ منزل المأكولات 📂 〙","『2』〘 تفعيل الحظ 📝 〙","『3』〘 ايقاف تفعيل الحظ 📝 〙","『4』〘 تفعيل التسريع 📝 〙","『5』〘 ايقاف التسريع 📝 〙","『6』〘 تسريع المنطاد 📝 〙","『7』〘 الغاء تركيب ملف الحظ 📝 〙"," رجوع↩️ ",}
---------------------------------------SeaFoodHome---------------------------------
list_seafood = {"『1』〘 تفعيل الكل 📝 〙","『2』〘 أعشاب الخليج 📝 〙","『3』〘 أعشاب البحر 📝 〙","『4』〘 صدفه 📝 〙","『5』〘 حلزون البحر البزاق 📝 〙","『6』〘 مرجان 📝 〙","『7』〘 نجم البحر 📝 〙","『8』〘 أخطبوط 📝 〙","『9』〘 السلطعون 📝 〙","『10』〘 جمبري أبوسوم 📝 〙","『11』〘 كابوريا الطين 📝 〙","『12』〘 الكابوريا 📝 〙","『13』〘 سلطعون مثلج 📝 〙","『14』〘 سلطعون الضفدع الأحمر 📝 〙"," رجوع ↩️ ",}
lucky_percentage={{['Code']='5011;7;500017;5',['Refine']='7;5'},{['Code']='31031;15',['Refine']='15'},{['Code']='31022;50',['Refine']='50'},{['Code']='31023;30',['Refine']='30'},{['Code']='31032;20;31027;30',['Refine']='20;30'},{['Code']='31028;30',['Refine']='30'},{['Code']='31030;20',['Refine']='20'},{['Code']='31024;50',['Refine']='50'},{['Code']='700052;10',['Refine']='10'},{['Code']='31025;40',['Refine']='40'},{['Code']='31026;6;31025;15',['Refine']='6;15'},{['Code']='31036;50',['Refine']='50'},{['Code']='31026;15',['Refine']='15'}}
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------HOME_animals(3)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_choices={"『1』〘 قائمة ملابس الحيوانات 📂 〙","『2』〘 اختيار الحيوان ذكر او انثى 📝 〙","『3』〘 اخراج جميع الجيوانات 📝 〙","『4』〘 تكبير الحيوانات 📝 〙"," رجوع↩️ "} Superfood="📃 يجب توفر طعام خارق"
---------------------animalsClothes-------------------------------
clothes_list={"『1』〘 قائمة ملابس السلحفاة 📂 〙","『2』〘 قائمة نظارات الدب 📂 〙", "『3』〘 قائمة ملابس القط 📂 〙","『4』〘 قائمة القبعات 📂 〙", "『5』〘 قائمة ملابس الكلاب 📂 〙","『6』〘 قائمة ملابس القنفذ 📂 〙"," رجوع↩️ "}
choices_1 =  {"『1』〘 لباس رقم -1 📝 〙","『2』〘 لباس رقم -2 📝 〙","『3』〘 لباس رقم -3 📝 〙","『4』〘 لباس رقم -4 📝 〙","『5』〘 لباس رقم -5 📝 〙","『6』〘 لباس رقم -6 📝 〙"," رجوع↩️ ",}
choices_2 =  {"『1』〘 لباس رقم -1 📝 〙","『2』〘 لباس رقم -2 📝 〙","『3』〘 لباس رقم -3 📝 〙","『4』〘 لباس رقم -4 📝 〙","『5』〘 لباس رقم -5 📝 〙","『6』〘 لباس رقم -6 📝 〙","『7』〘 لباس رقم -7 📝 〙" ,  " رجوع↩️ ", }
choices_3 =  {"『1』〘 لباس رقم -1 📝 〙","『2』〘 لباس رقم -2 📝 〙","『3』〘 لباس رقم -3 📝 〙"," رجوع↩️ ",}
choices_4 =  {"『1』〘 قبعة رقم -1 📝 〙","『2』〘 قبعة رقم -2 📝 〙","『3』〘 قبعة رقم -3 📝 〙","『4』〘 قبعة رقم -4 📝 〙","『5』〘 قبعة رقم -5 📝 〙","『6』〘 قبعة رقم -6 📝 〙","『7』〘 قبعة رقم -7 📝 〙","『8』〘 قبعة رقم -8 📝 〙" ,"『9』〘 قبعة رقم -9 📝 〙", "『10』〘 قبعة رقم -10 📝 〙","『11』〘 قبعة رقم -11 📝 〙", "『12』 قبعة رقم -12 📝 〙",  "『13』〘 قبعة رقم -13 📝 〙", "『14』〘 قبعة رقم -14 📝 〙"," رجوع ↩️ ", }
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------HOME_Special_tasks(4)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
other_tasks={"『1』〘 المهام اليومية 📝 〙","『2』〘 المشفي 📝 〙","『3』〘 إلغاء تحميل مصانع الخردة 📝 〙","『4』 فتح ثلاث نجوم الزوار 📝 〙","『5』〘 جوازات السفر 0 نقود 📝 〙","『6』〘 تدمير الخطأ 📝 〙","『7』〘 تبرع المجتمع بالأصفر 📝 〙","『8』〘 فتح 3 نجوم الات الجزيرة 📝 〙"," رجوع↩️ ", }
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------------------------HOME_BUY(5)-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_buy = {'『1』〘 أسماك 📂 〙','『2』〘 تحصيل 📂 〙','『3』〘 منتجات بالفيزا 📂 〙','『4』〘 منتجات مطورات 📂 〙','『5』〘 منتجات الجزيرة 📂 〙','『6』〘 منتجات الآلات المغلقة 📂 〙','『7』〘 شراء بالكود 📝 〙','『8』〘 اعادة الضبط لشراء منتجات آخري 📝 〙',' رجوع↩️ '} moqed = "🔥قم بفتح موقد الطهي واختار وصفة معكرونه بالجبن 🔥"
fishes ={['اذان البحر'] = '700075',['مرجان'] = '700036',['اعشاب الخليج'] = '700041',['جمبري عملاق'] = '700077',['ماكريل'] = '700021',['جمبري السرعوف'] = '700029',['اعشاب البحر '] = '700042',['سلطعون الضفدع الاحمر '] = '700034',['الكابوريا'] = '700033',['صدفة'] = '700024',['اخطبوط'] = '700039',['حلزون البحر البزاق'] = '700026',['سمك صدفي'] = '700074',['السلطعون'] = '700028',['سلطعون مثلج'] = '700076',}
rare_p ={['بيضة القرن']= '41055',['بتلة خيزران'] = '41061',['ريشة يونيكورن'] = '41081',['ريش النحام الوردي'] = '41057',['مخمل رنة الاحتفال'] = '41085',['ريش فينكس'] = '41083',['قدم ديك الرومي'] = '41079',['شعر حصان عيد الحب'] = '41087',['حليب غزال المحظوظ'] = '41073',['كعكة الفطائر المنفوخه الزهره الزرقاء'] = '207801',['كعكة الفطائر المنفوخه الزهره الحمراء'] = '207802',['كعكة الفطائر المنفوخه بالصباره'] = '207803',['كعكة الفطائر المنفوخه بالزنبق'] = '207804',['كعكة الفطائر المنفوخه بزهره السوسن'] = '207805',['كعكة الفطائر المنفوخه بلوميريا'] = '207806'}
lucky_p={['جلد ثور فرنسي'] = '22070',['جزر بلاستيك'] = '22038',['باقة زهور مجففة'] = '22074',['عصير فرنسي'] = '22046',['طبق فواكة'] = '22034',['صلصة ميكس'] = '22050',['جبن زرقاء'] = '22002',['دمية الغزال'] = '22058',['حليب بودرة'] = '22001',['ريشة طاووس اسود'] = '22082',['لحم نعامة سوداء'] = '22085',['جلد نعامة سوداء'] = '22088',['برغر صغير'] = '22042',['جلد رقيق'] = '22078',['خبز فرنسي'] = '22066',['ريش دجاج'] = '22025',['مصاصة'] = '22062',['مهلبية شامية'] = '22029',['علف'] = '22024',['دبس سكر'] = '22054',['فرو مخمل '] = '22037',['بيض احمر'] = '22023',}
island_p={['حجر قرميد'] = '610008',['انبوب ماء'] = '610009',['مراه تجميل'] = '610006',['نشارة خشب '] = '630005',['دمية مخفية'] = '610002',['صندوق انقاذ حيوان'] = '611002',['لوحة رسم زيتية'] = '610003',['قرون'] = '610015',['اسطوانة خشبية'] = '630001',['خشب ساندرز'] = '8021',['برميل بارود'] = '619004',['خشب البلوط'] = '8013',['خشبة'] = '630002',['قنبلة'] = '619003',['خشب الارز'] = '8017',['لوح خشبي'] = '630003',['ديناميت'] = '619002',['بارود'] = '619001',['أوراق التوت'] = '8009',['قرن وحيد القرن']= '610015',['تاج ذهبي']='3034',['علبة تجميل'] = '610005',['زجاج اريج خشبي'] = '610004',['مطاط'] = '8032',['خيزران'] = '8005',['كستناء'] = '8003',}
special_p={['الكمأة بيضاء'] = '501152',	['جرجير'] = '500655',	['حنطة سوداء'] = '500836',	['عدس'] = '500765',	['كافيار أسود'] = '500776',	['اوراق الخيزران'] = '501166',	['كزبرة'] = '500714',	['السمسم'] = '501397',	['بصل اخضر'] = '500989',	['قبار '] = '500631',	['خميرة'] = '500139',	['شمندر احمر '] = '501286',	['رواند'] = '500564',	['فلفل الحار'] = '501066',	['بط مشوي'] = '501246',	['فانيلا'] = '500466',	['خل ابيض'] = '30221',	['بقدونس'] = '501082',	['الهيل'] = '501609',	['طحين صودا'] = '500623',	['ريحان'] = '500826',	['براعم البقوليات'] = '500846',	['ثوم معمر'] = '501587',['قطرم'] = '500816',}
locked_p={['فوشار بزبدة الفستق'] = '200531', ['دمية الطاووس'] = '300018', ['قهوة قيقب'] = '65022', ['قهوة هاواي'] = '65023', ['قهوة الكرز'] = '65024', ['شوكولاتة بالموز'] = '200574', ['شوكولاتة بالتين'] = '200575', ['شوكولاتة بالمشمش'] = '200576',['قهوة كريمة'] = '65011'}
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------------HOME_PALANtS(6)-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
cultivation = {"『1』〘 اوراق برسيم الاربعة 📝 〙","『2』〘 جواهر الذرة الزجاجي 📝 〙","『3』〘 يقطين والطماطم 📝 〙","『4』〘 فلفل هاينان 📝 〙","『5』〘 فول محمص 📝 〙","『6』〘 فطر المارشملو 📝  〙","『7』〘 بطيخ المحبة 📝  〙","『8』〘 تفاح سوري 📝 〙","『9』〘 كرز سوريناني 📝 〙","『10』〘 رامبوتان 📝 〙","『11』〘 ليمون الماسية 📝 〙","『12』〘 بذور الخوخ 📝 〙","『13』〘 أجاص اسيوي 📝 〙","『14』〘 زيتون كريستالي 📝 〙","『15』〘 البوط 📝 〙","『16』〘 بندورة 📝 〙"," رجوع↩️ ",}
cafe = " قم باختيار زرع حبوب القهوة ثم اختار نوع الزرع 📃 "
ananola = " قم باختيار زرع الأناناولة قبل اختيار البندورة 📃 "
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------------HOME_Change_Farms(7)--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_change = {"『1』〘 💫 اسـتـخــــراج يــوزر الـمـزرعــــة 💫 〙","『2』〘 💫 فــتــح يــوزر الـمــزرعــة مــن الــهـاتــف 💫 〙","『3』〘 💫 تـبــديـل يــوزر الـمـزرعـــة 💫 〙","『4』〘 💫 حـذف يــوزرات الـمـزارع المحـفـوظـة 💫 〙"," رجوع 🔙"}
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
---------------------------------------------HOME_App_Store(8)-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
headerStore = "مرحبا"
msgExs = "💥✨💫 Exclusive By The Stars Team 💫✨💥 \n 💥✨💫 حصري بواسطة فريق النجوم 💫✨💥" DonateMSG = "قريبا"
urls = {
    '',
    'https://bit.ly/3TWWJCD',
    'https://d.apkpure.com/b/APK/com.google.android.gm?version=latest',
    'https://bit.ly/3VZnj0J',
    'https://bit.ly/3UdXQiP',
    'https://bit.ly/3VZmUvf',
    'https://bit.ly/4aG2UBQ',
    'https://bit.ly/4aKoWnz',
    'https://bit.ly/3VTxLqe',
    'https://bit.ly/4aVh3LN',
    'https://bit.ly/3U2t8aW',
    'https://bit.ly/3wmY4L7',
    'https://bit.ly/3JDWpEc',
    'https://bit.ly/4dbqHvz',
    'https://bit.ly/3UB7EmV',
}
names = {
    '',
    'candy crush.apk',
    'Stars-GG.apk',
    'GameGuardian.101.1.apk',
    'EZ-auto-clicker.apk',
    'ES-file-explorer.apk',
    'MT_Manager-v2.15.2_Mod.apk',
    'App-Cloner-v1.5.32-Mod.zip',
    'Auto-clicker.apk',
    '0.7.6.2.05-CN_FixA12_GuanYinLITE.apk',
    'Sandbox1_0.7.6.2.05.apk',
    'Sandbox2_0.7.6.2.05.apk',
    'Sandbox3_0.7.6.2.05.apk',
    'Sandbox4_0.7.6.2.05.apk',
    'Sandbox5_0.7.6.2.05.apk',
}
urls_name = {
    'بحث',
    'تحديث المزرعة',
    'جيم جاردن النجوم',
    'جيم جاردن الرسمي',
    'حافظ النقرات EZ',
    'مستكشف الملفات ES',
    'مستكشف MT manager',
    'ناسخ التطبيقات App Cloner',
    'تطبيق Auto Clicker',
    'ساند بوكس VIP Lifetime',
    'ساند VIP Multibox 1',
    'ساند VIP MultiBox 2',
    'ساند VIP Multibox 3',
    'ساند VIP Multibox 4',
    'ساند VIP Multibox 5',
    'رجوع',
} 
----------------------------------------------------Home_VIP(9)----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
list_vip = {"『1』〘 فــتـح الكــشـك بـعــد غـلـقـه 📝 〙","『2』〘 شــراء قـــارورة بـنـفـسـجـيـة 📝 〙","『3』〘 تـثـبـيـت صـنـــارة الصـيـد بالمـنتـصـف 📝 〙","『4』〘 فـــاعـلـيـة التــلقائـي 📝 〙","『5』〘 تـخـطـي نقـــاط الجــزيـرة بالمـصــانـع 📝 〙","『6』〘 طــاقـة نــافـورة الــوفــرة 📝 〙"," رجوع↩️ ", }
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Help_menu = {"『1』〘 روابط مساعدة للتهكير 📝〙","『2』〘 بعض اكواد المزرعة 📝〙", "  رجوع ↩️ ",} 
Urls_name = {"『1』〘 المزرعه الاصدار الأخير 7.8.100 📝〙","『2』〘 جيم جاردن ELNGOME 📝〙","『3』〘 جيم جاردن الرسمي اخر اصدار 📝〙","『4』〘 ملف الشامل ELNGOME 📝〙","『5』〘 قريبا 📝〙", "『6』〘 اF1 لاندرويد ١٣ 📝〙","『7』〘 جاجا اندرويد ١٢ و ١٣ 📝〙","『8』〘 ساند اندرويد ١٢ 📝〙","『9』〘 اللانشر 📝〙","『10』〘 ساند اندرويد 11 📝〙","『11』〘 الساند لاندرويد 7حتي11 📝〙","『12』〘 الجاجا 📝〙","『13』〘 فيموس اندرويد 12 📝〙", "『14』〘 روم فيموس 📝〙 ", "『15』〘 اداه تفعيل فيموس 📝〙", "『16』〘 متجر Apkpure  لتحديث المزرعه 📝〙","『17』〘 المستكشفes 📝〙","『18』〘 المستكشفMT 📝〙","『19』〘 اClone app pro 📝〙 ", "『20』〘 الفرس التلقائي اوتو كليكر 📝〙", "『21』〘 اوتو كليكر 📝〙", "『22』〘 انقر مساعد اوتو كليكر 📝〙","『23』〘 اVMOS unlocker 📝〙", "  رجوع↩️ "}
Urls = {"https://family-farm.ar.uptodown.com/android/download", "https://www.mediafire.com/file/1h434ode5zr92h1/GG-%25D9%2581%25D8%25B1%25D9%258A%25D9%2582_%25D8%25A7%25D9%2584%25D9%2586%25D8%25AC%25D9%2588%25D9%2585_V2.0.apk/file"," https://www.mediafire.com/download/b5mjmtbuv9ibs6h",  "https://www.mediafire.com/file/i5b3kitpj5tr7b3/ELNGOME_23.lua/file"," قريبا رابط ملف الاكواد","https://51down.51mnq.com/a/f1vm-v1.3.1.3.07-64gpfn-gp-release-withrom-202207141614.apk", "https://www.mediafire.com/file/9i7t0o1emmzravd/vphonegaga_for_Android_12%252613.apk/file", "https://x8files-1251460295.file.myqcloud.com/a/x8sandbox-v0.7.6.2.09-64gp-gp-release-withrom-202202231128.apk",  "https://x8files-1251460295.file.myqcloud.com/a/x8_51_android12_helper1.4.2.apk",  " https://www.mediafire.com/file/ikwiu6fqu1%20lwxrs/X8_SANDBOX_0.7.6.0.04_LITE_%20VIP(Aspectre).apk/file", "https://www.mediafire.com/file/osh449xtam80v2f/x8sandbox-v0.7.5.6.03-64gp-gp-release-withrom-202104021540.apk/file", "https://www.mediafire.com/download/i8xbi2p372q3j1f"," https://www.mediafire.com/file/tow5h9ue4msba1a/VMOS_Pro_v1.7.0-PRM.apk/file", "https://www.mediafire.com/file/8noynzb3a4fgn5s/MagiskRoot%252BXposed%252BGApp-64bit_%257BREC_ROM%257D.zip/file","https://www.vmos.cn/zhushou.htm ", "https://m.apkpure.com/apkpure/com.apkpure.aegon/download","https://www.mediafire.com/download/fkbu0k27czsapgp", "https://www.mediafire.com/download/2xzjbxg5lvnk40t",  "https://www.mediafire.com/download/ccr4wzi39sy3l4y", " https://www.mediafire.com/download/wp22v1a84cdqko2", "https://www.mediafire.com/download/70lq51z7jru4bl4",   " https://www.mediafire.com/download/149kku4innpyxq2","https://apkcombo.com/ar/vmos-unlocker/com.vmos.adclient", }

Machines1={["اله تشورو"] = "207700",["اله الهوت دوج"] = "30141",["اله الحساء"] = "207600",["اله الكيشمي"] = "30222",["اله شوي السمك "] = "30300",["اله سله الزهور "] = "11800",["اله القهوه "] = "20045",["اله البيتزا "] = "20090",["اله السكر "] = "20123",["اله السميط"] = "207300",["اله خبز الزنجبيل "] = "207400",["اله الدفء "] = "206200",["اله العلكه"] = "206700",["اله الحبوب"] = "206400",["اله الوافل"] = "206800",["اله نحت الرمل"] = "205800",["اله ذبادي مثلج"] = "206300",["اله التاكو"] = "205900",["اله النودلز "] = "206900",["اله الثلج المجروش"] = "207000",["اله الكاب كيك"] = "206600",["االه قناع الهالوين"] = "207200",["اله نحت الجليد "] = "207500",["صانع بتله الزهره"] = "205500",["اله صنداي "] = "205700",["اله معكرونه سريعه التحضير"] = "205600",["اله الماكرون "] = "205400",["اله حلوه الدب"] = "205300",["اله صنع رقائق  البطاطس"] = "204900",["اله الدونات"] = "205000",["اله دولاب السباحه"] = "205100",["صانع زي الهالوين"] = "205200",["اله شموع معطره"] = "206000",[" اله البالون"] = "204300",["اله الصودا"] = "204700",[" اله القلي"] = "204600",["صانعه بأن كيك"] = "204800",["مصن� سانتا"] = "204500",["موقد القرميد التقليدي"] = "204400",["اله المعلبات "] = "204200",}

Animals={["الحصان"] ="52000",["الفيل "] ="41038",["القرد "] = "41040",["ماعز دمشقي"] = "20037",["ثور فرنسي"] = "20112",["الالبكه "] = "20126",["النعامه"] = "20140",["ديك رومي"] = "20143",["الخاروف الاحمر "] = "4004",["الطاوووس"] = "6001",["رومى أبيض"] = "20143",["الرنه"] = "14000",["الخروف الدمشقي"] = "41052",["الجاموس"] = "200325", ["النحام الوردى"] = "41056", ["الكيباء"] = "41058", ["الحمار الوحشي"] = "41074", [" اوز أسود العنق"] = "41067",}

mtwer1={["بسطرمة لحم"] = "22101",["دمية خالد "] = "22097",["حليب بودرة"] = "22001",	["ريشة طاووس اسود"] = "22082",	["لحم نعامة سوداء"] = "22085",	["جلد نعامة سوداء"] = "22088",	["برغر صغير"] = "22042",	["جلد رقيق"] = "22078",	["خبز فرنسي"] = "22066",	["ريش دجاج"] = "22025",	["مهلبية شامية"] = "22029",	["علف"] = "22024",	["دبس سكر"] = "22054",	["فرو مخمل "] = "22037",	["بيض احمر"] = "22023",	["جلد ثور فرنسي"] = "22070",	["جزر �لاستيك"] = "22038",	["باقة زهور مجففة"] = "22074",	["عصير فرنسي"] = "22046",	["طبق فواكة"] = "22034",	["صلصة ميكس"] = "22050",	["جبن زرقاء"] = "22002",	["دمية الغزال"] = "22058",	["مصاصة"] = "22062",}

Masar={["مسار النزهات"] ="1008",["بركة ماء"] ="39999",["بركة شاطئ"] = "40002",["مسار حصاة"] = "590015",["مسار خشبى"] = "590016",["مسار الغابة"] = "590128",["صخرة مع زهرة"] = "590174",["مسار الماكرون"] = "590194",["مسار زراعى"] = "598001",["مسار قرميدى"] = "598002",["مسار ثلجى"] = "598003",["مسار الكريسماس"] = "598004",	["حوض حليب خارق"] ="80003",["اناء الجبن الخارق"] ="80103",["وعاء طحين خارق"] = "80203",	["وعاء بيض خارق"] = "80303",["وعاء عصير خارق"] = "80503",["وعاء جزر خارق"] = "80603",	["وعاء برغر خارق"] = "80622",["قالب عصارة خارق"] = "80642",["وعاء صلصة خارق"] = "80662",	["وعاء سكر خارق"] = "80682",["حاوية لحم الغزلان"] = "80702",	["حاوية الحلوي الخارق"] = "80722",["حاوية الخبز الخارق"] = "80742",}

Thare={["بوط"] ="7046",["بندورة"] ="7048",["ورد ابيض"] = "5009",["توفى التفاح"] = "7084",["زهره ورديه"] = "200227", ["اللافندر"] = "30072",["جزر"] = "32",["ورقه حلوه"] = "7090",["فراوله"] = "132",["باميه"] = "7078",["باشن فروت"] = "7054",["نبات عشبى"] = "7052",["الفجل"] = "7074",["عنب لبنانى"] = "200457",["زنبق يومى"] = "7124", ["نبات اوريو"] = "7060", ["فستق"] = "20005", ["فاكهه الشر"] = "7100", ["بصل"] = "9119", ["قرنبيط"] = "20024",	["صبار"] = "7094",	["عناب"] = "83",	["زهره الحب"] = "300003",	["التوليب"] = "5003",	["الزنبق"] = "5001",	["ورد احمر"] = "5005",	["بطاطا"] = "147",	["زهره الاشباح المقدسه"] = "7122",	["توت شامى"] = "85",	["اناناس"] = "4007",	["حلوى الهيكل العظمى"] = "7082",	["سبانخ"] = "500567",	["اقحوان"] = "9117",	["فول"] = "20000",	["زنبق الوادى"] = "7126",	["الكيوى الذهبى"] = "7092",	["عباد الشمس"] = "9121",	["مفرقع المهرجان"] = "7088",	["توت برى"] = "87",	["شوفان"] = "200422",	["نجمه الحظ"] = "7086",	["عنب اخضر"] = "200001",	["فاكهه فرانكشتاين"] = "7102",	["الذره"] = "13",	["الخس"] = "149",	["كرات"] = "7096",	["باذنجان"] = "20020",	["بطيخ"] = "4006",	["بتله خيزران"] = "7064",	["زهره الربيع الورديه"] = "50026",	["حبوب القهوه"] = "20026",	["زهره السوسن"] = "50036",	["الخردل"] = "7072",	["فلل جالابينو"] = "7108",	["يقطين"] = "153",	["ورد ازرق"] = "5007",	["سله حلوى الهالوين"] = "7120",	["فاصوليا خضراء"] = "500325",	["قمح"] = "3",	["برسيم"] = "4",	["شمندر سكرى"] = "200527",	["الهندباء"] = "7056",	["عنب"] = "41",	["كرفس"] = "7080",	["نخاله"] = "65002",	["بطاطا حلوه"] = "9123",	["طماطم"] = "2",	["قطن"] = "20022",	["فطر"] = "9114",	["فلفل احمر"] = "151",	["عشب"] = "20028",	["ملفوف"] = "500147",	["ثمره الحب"] = "9411",	["كاكاو"] = "7110",	["خيار"] = "30127",	["فطر الشبح"] = "7062",	["الرخس"] = "500351",	["زهره اللوتس"] = "30145",	["قصب"] = "20121",	["زنجبيل"] = "7076",	["زهره البالون"] = "7058",	["بوط"] = "7046",	["يقطين الهالوين"] = "500176",	["فاكهه التين"] = "200007",	["الارز"] = "6003",}

Mokhtpr = {["ليمون الماسية"] = "5115",["رامبوتان"] = "5113",["بذور الخوخ"] = "5123",["تفاح سوري "] = "5109",["كرز سوريناني"] = "5111",["زيتون كريستالي"] = "5127",["اجاص اسيوي"] = "5125",["اوراق البرسيم الاربعة"] = "5101",["فول محمص"] = "5117",["بطيخ المحبة"] = "5121",["اليقطين والطماطم"] = "5105",["جواهر الذرة زجاجي"] = "5103", ["فلفل هاينان"] = "5107", ["فطر المارشملو"] = "5119",}

Fa = {["اله الوافل"] = "206800",["الطاوووس"] = "6001"}

Yellow_ak= {"『1』〘 تحصيل 📝〙","『2』〘 اسماك 📝〙","『3』〘 خشب ومتفجرات 📝〙","『4』〘 منتجات فيزا 📝〙","『5』〘 منتجات عشوائي 📝〙","『6』〘 بيت الاسماك والتجميل 📝〙","『7』〘 جزيرة 📝〙","  رجوع ↩️ ",}

th1={["الكمأة بيضاء"] = "501152",["جرجير"] = "500655",["حنطة سوداء"] = "500836",	["عدس"] = "500765",	["كافيار اسود"] = "500776",	["اوراق الخيزران"] = "501166",	["كزبرة"] = "500714",	["السمسم"] = "501397",	["بصل اخضر"] = "500989",	["قبار "] = "500631",	["خميرة"] = "500139",	["شمندر احمر "] = "501286",	["رواند"] = "500564",	["فلفل الحار"] = "501066",	["بط مشوي"] = "501246",	["فانيلا"] = "500466",	["خل ابيض"] = "30221",	["بقدونس"] = "501082",	["الهيل"] = "501609",	["طحين صودا"] = "500623",	["ريحان"] = "500826",	["براعم البقوليات"] = "500846",	["ثوم معمر"] = "501587",	["قطرم"] = "500816"}

fishes1 = {["حلزون البحر البزاق"] = "700026",["سمك صدفي"] = "700074",["السلطعون"] = "700028",["اذان البحر "] = "700075",["ماكريل"] = "700021",["جمبري السرعوف"] = "700029",	["اعشاب البحر "] = "700042",	["سلطعون الضفدع الاحمر "] = "700034",	["الكابوريا"] = "700033",	["صدفة"] = "700024",	["اخطبوط"] = "700039",	["مرجان"] = "700036",	["اعشاب الخليج"] = "700041",	["جمبري عملاق"] = "700077",	["سلطعون مثلج"] = "700076",}

factories = {["اسطوانة خشبية"] = "630001",["خشبة"] = "630002",["لوح خشبي"] = "630003",["نشارة خشب "] = "630005",["قنبلة"] = "619003",["ديناميت"] = "619002",["برميل بارود"] = "619004",["انبوب ماء"] = "610009",["قرون"] = "610015",["بارود"] = "619001",["مراه تجميل"] = "610006",["دمية مخفية"] = "610002",["لوحة رسم زيتية"] = "610003",["علبة تجميل"] = "610005",["زجاجة اريج خشبي"] = "610004",["حجر قرميد"] = "610008",["صندوق انقاذ حيوان"] = "611002",}

trees2={["كستناء"] = "8003",["خيزران"] = "8005",["أوراق التوت"] = "8009",["مطاط"] = "8023",["خشب البلوط"] = "8013",["خشب الارز"] = "8017",["خشب ساندرز"] = "8021",}

shhn1={["فوشار زبدة الفستق"] = "200531",["كعكه الفطائر المنفوخه الزهره الزرقاء"]= "207801",	["كعكه الفطائر المنفوخه الزهره الحمراء "] = "207802",	["كعكه الفطائر المنفوخه بالصباره"] = "207803",	["كعكه الفطائر المنفوخه بالزنبق"] = "207804",	["كعكه الفطائر المنفوخه بزهره السوسن"] = "207805",		["كعكه الفطائر المنفوخه بلوميريا"] = "207806",	[" بيضة القرن"]= "8013",	["بتلة خيزران"] = "41061",	["ريشة يونيكورن"] = "41081",	["ريش النحام الوردي"] = "41057",	["مخمل رنة الاحتفال"] = "41085",	["ريش فينكس"] = "41083",	["ريش اوز اسود العنق"] =  "41077",}

Machines2 = {}

MachinesP2={["صابون غار"] = "203101",["صابون بابونج"] = "203102",["صابون ورد احمر"] = "203104",["صابون بالعسل"] = "203105",["صابون توليب"] = "203106",["صابون عباد الشمس "] = "203107",["صابون بنفسج"] = "203108",["ساشيمي  سكلوب"] = "203502",["ساشيمي اخطبوط "] = "203503",["ساشيمي حبار"] = "203504",["ساشيمي ماكريل"] = "203506",["سله بابونج "] = "11801",["سله زنبق"] = "11802",["سله ورد ابيض"] = "11803",["سله زهره العسل"] = "11804",["سله الياسمين"] = "11805",["سله زهره البنفسج "] = "11806",["سله زهره ورديه"] = "11807",["خبز الزبيب"] = "11101",[" خبز الثوم"] = "11103",["خبز كوسا"] = "11104",["خبز عنيبه حاده"] = "11105",["خبز بالقرفه"] = "11106",["خبز الفراولة "] = "11107",["خبز كيوي"] = "11108",["خبز انانوله"] = "11109",["خبز بالكاكايا"] = "11110",}

tgmil1={["الاسكالوب المجفف"] = "31005",["محاره"] = "31006",["حلزون البحر "] = "31007",["لحم جمبري"] = "31008",["جمبري السرعوف علي البخار "] = "31009",["جمبري ابو سوم علي البخار"] = "31010",["سلطعون الطين علي البخار"] = "31011",["سلطعون علي البخار"] = "31012",["سلطعون الضفدع الأحمر المطبوخ"] = "31013",["بودر المرجان"] = "31014",["نجم البحر المجفف "] = "31015",["قنديل البحر المملح"] = "31016",["لحم الاخطبوط"] = "31017",["مسحوق الطحالب"] = "31018",["أعشاب بحريه مطبوخه "] = "31019",["طحالب بحريه جافه"] = "31020",["خس البحر المطبوخ"] = "31021",["لؤلؤ"] = "31022",["قوقعه حلزون البحر "] = "31023",["كرات الجمبري"] = "31024",["ستيك سلطعون "] = "31025",["بطارخ سلطعون "] = "31026",["غصن مرجان"] = "31027",["بيض نجم البحر "] = "31028",["مرقعه الحبر"] = "31030",["صلصال الطحالب"] = "31031",["شرائح مرجان"] = "31032",["صدف اذن البحر"] = "31033",["جمبري ضخم علي البخار"] = "31034",["سلطعون مثلج علي البخار "] = "31035",["سلطعون  لازق"] = "31036",["قلاده حمراء"] = "32010",["قلاده المحار"] = "32011",["قلاده  اللؤلؤ"] = "32012",["قرط الأذن بالصدف"] = "32013",["قرط الأذن ريشه الطاؤس"] = "32014",["قرط الأذن ريشه الاوز"] = "22015",["قناع الوجه بالطين"] = "32016",["قناع الوجه بالاعشاب البحريه"] = "32017",["قناع الوجه بالشوفان"] = "32018",["قناع الوجه بالورد"] = "32019",["قناع الوجه بالحليب"] = "32020",["قناع الوجه بالمايونيز"] = "32021",["قناع الوجه  باليمون"] = "32022",["قناع الوجه  المرجاني "] = "32023",["قناع الوجه بالموز"] = "32024",["مراه علي شكل قنديل البحر "] = "32025",["مرآة ورد مرجاني"] = "32026",["مرآة اللؤلؤ"] = "32027",["خاتم الورد"] = "500389",["اكليل الغار"] = "500410",["قرط اذن الحب"] = "500412",["زجاجه اريج شجره الشاي"] = "32028",["قلاده الريش "] = "500452",["زجاجه اريج  لافندر "] = "32029",["زجاجه اريج بابونج"] = "32030",["زجاجه اريج زهره العسل"] = "32031",["زجاجه اريج الزنبق"] = "32032",["زجاجه اريج  زهره  البنفسجي"] = "32033",["اكليل بلومريا"] = "500517",["قلاده بيضاء"] = "500546",["قلب ازرق"] = "500547",["قلاده زجاجيه"] = "500548",["قناع افوكادو"] = "500666",["كريم زيتون الوجه"] = "500676",["صابون الاجاص ليد"] = "500798",["مرهم شفاه بنكهه الجوافه"] = "500935",["كريم مصنوع يدويا"] = "501122",}

cod = {"『1』〘🔎تعديل 🔍📝〙","『2』〘 كود اله المهمة 📝〙","『3』〘 كود الالات 📝〙","『4』〘 كود الحيوانات 📝〙","『5』〘 المسارات وقطع المطورات 📝〙","『6』〘 كود منتجات بالاصفر 📝〙","『7』〘 كود مزروعات المختبر 📝〙","  رجوع ↩️ "}

cod1= {"『1』〘🔎 محرك البحث 🔍📝〙","『2』〘 كود اله المهمة 📝〙","『3』〘 كود الالات 📝〙","『4』〘 كود الحيوانات 📝〙","『5』〘 المسارات وقطع المطورات 📝〙","『6』〘 كود منتجات بالاصفر 📝〙","『7』〘 كود مزروعات المختبر 📝〙"," رجوع ↩️ ",}

------------------------------------------HOME---------------------------------------------
function HOME() gg.setVisible(false)
header = hh[math.random(1, #hh)]
elngoom = gg.choice(elngooom,nil,header)
if elngoom== nil then  else
if elngoom==1  then HOME_ALL() end
if elngoom==2  then speed_luck()end
if elngoom==3  then animals()end
if elngoom==4  then special_tasks() end
if elngoom==5  then buy() end
if elngoom==6  then gg.alert(cafe) plants() end
if elngoom==7  then changeFarms() end
if elngoom==8  then appStore() end
if elngoom==9  then vip() end
if elngoom==10 then Exit() end
end
ex(0) 
  end
  ------------------------------------HOME_ALL(1)-----------------------------------------
function HOME_ALL() gg.setVisible(false)
allcho = gg.choice(allccho,nil,header)
if allcho == nil then ex(1) end
if allcho == 1 then developer() end
if allcho == 2 then fake() end
if allcho == 3 then NOGOM("h 73 69 7A 65 5F 79",1,nil,10000,'0',1,nil,1,1) NOGOM("h 73 69 7A 65 5F 78",1,nil,10000,'0',1,nil,1,1) NOGOM("h 74 72 65 65 5F 73 70 61 63 69 6E 67",1,nil,10000,'0',1,nil,1,1) end 
if allcho == 4 then NOGOM('200;1000',4,'1000',300,'9999999',1,1,1,1) NOGOM('200;1200',4,'1200',300,'9999999',1,1,1,1) end 
if allcho == 5 then gg.alert(Cleaning_tickets)NOGOM('300;20',64,'20',300,'300',1,1,1,1) end
if allcho == 6 then gg.alert(Khaled_house)  NOGOM('50000;5;1',4,'1',10000,'1000',1,1,1,1) NOGOM("h 73 69 7A 65 5F 79",1,nil,10000,'0',1,nil,1,1) NOGOM("h 73 69 7A 65 5F 78",1,nil,10000,'0',1,nil,1,1) gg.alert(donekhaledHouse)end
if allcho == 7 then gg.alert(fish_tank) NOGOM('80;600;1800',4,nil,300,'0',1,nil,1,1) end
if allcho == 8 then gg.alert(millionaire_cow) NOGOM('6001',4,nil,300,'590048',1,nil,1,1) end
if allcho == 9 then HOME () end
ex(1) 
 end
------------طلب مطورات من الجيران--------
function developer () gg.setVisible(false)
	gadgets_ch = gg.multiChoice(developer_gadgets,nil,header)
if gadgets_ch == nil then else 
if gadgets_ch[1] then
	   for j = 2, 25 do
	      gadgets_ch[j] = true
	   end
	end
	for i = 2, 25 do
	   if gadgets_ch[i]then
		NOGOM(codes_gadgets[i],64,nil,300,'15',1,nil,1,1)
       end
	end
    if gadgets_ch[26] then HOME_ALL() end
end
end
-----------------دنانير وهمي-------------
function fake() gg.setVisible(false)
--	gg.alert("⛔️ سيتم اعادة فتحها قريبا ⛔️")
 typ = gg.choice(fake1,nil,header)
 if typ == nil then ex(1)  end
 if typ==1  then gg.alert(fakea) NOGOM ('590352;5',64,'5',17000,'-1000000',1,1,1,1) NOGOM ('41038;41040',64,nil,17000,'400009;74',1,nil,1,1) NOGOM ('590352;590353',64,nil,17000,'400009;74',1,nil,1,1) end
 if typ==2  then gg.alert(fakeB) NOGOM (':600027',1,nil,17000,':400009',1,nil,1,1) end
 if typ==3 then HOME_ALL()  end
 ex(1)
end
---------------------------------------HOME_speed_luck(2)----------------------------------------------------
function speed_luck() gg.setVisible(false)
	if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_lucky.txt") then
   speedo_luck = gg.choice(list_luck,nil,header)
if speedo_luck == nil then ex(2) end
if speedo_luck == 1 then seafood() end
if speedo_luck == 2 then gg.unrandomizer(0) end
if speedo_luck == 3 then gg.unrandomizer(nil,nil,nil,nil) end
if speedo_luck == 4 then Speed() end
if speedo_luck == 5 then gg.setSpeed(1.0) end
if speedo_luck == 6 then pallon_speed() end
if speedo_luck == 7 then file_luck()end
if speedo_luck == 8 then HOME() end
ex(2)
else
speedo_luck = gg.choice(list_luck_rm,nil,header)
if speedo_luck == nil then ex(2) end
if speedo_luck == 1 then seafood() end
if speedo_luck == 2 then gg.unrandomizer(0) end
if speedo_luck == 3 then gg.unrandomizer(nil,nil,nil,nil) end
if speedo_luck == 4 then Speed() end
if speedo_luck == 5 then gg.setSpeed(1.0) end
if speedo_luck == 6 then pallon_speed() end
if speedo_luck == 7 then rm_file_luck()end
if speedo_luck == 8 then HOME() end
ex(2)
end
end
------------منزل المأكولات--------------
function seafood() gg.setVisible(false)
local seafood_list
seafood_list = gg.multiChoice(list_seafood,nil,header)
if seafood_list == nil then else end
     if seafood_list [15] == true  then  end
     if seafood_list [1] == true then
          for i = 1,#lucky_percentage
             do 
                SeaFoodAll(i) 
          end
     end
     for i = 1, #lucky_percentage
        do
         if seafood_list [i+1] == true then 
              SeaFoodAll(i)
         end
    end
end
function SeaFoodAll(index)NOGOM(lucky_percentage[index].Code,64,lucky_percentage[index].Refine,300,"100",1,1,1,1)end

---------------التسريع----------------
function Speed() gg.setVisible(false)
    gg.alert(msgSpeed)
    local speedInput = gg.prompt({"📃 ادخــل قـيـمـة التـسـريــــع : {المــوصــي بــه: 15}"}, {}, {"number"})
    if speedInput then
        local targetSpeed = tonumber(speedInput[1])
        if targetSpeed then
            local currentSpeed = gg.getSpeed()
            if currentSpeed then
                local increment
                
                -- تحديد قيمة الزيادة بناءً على الشروط
                if targetSpeed <= 30 then
                    increment = 3
                else
                    increment = 6
                end
                
                local delay = 4000  -- تأخير بين كل زيادة في السرعة بالميللي ثانية
                
                if targetSpeed > currentSpeed then
                    local tempSpeed = currentSpeed
                    while tempSpeed < targetSpeed do
                        tempSpeed = tempSpeed + increment
                        if tempSpeed > targetSpeed then
                            tempSpeed = targetSpeed
                        end
                        gg.setSpeed(tempSpeed)
                        gg.sleep(delay)
                    end
                end
            end
        end
    end
end

----------تسريع المنطاد------------
function pallon_speed() gg.setVisible(false)
local urls={'https://bit.ly/3xOR0HA','https://bit.ly/4aNCiiF','https://bit.ly/3xW0W1W'}
local files={GameInfo.dataDir .. '/Resources/scripts/pet_team/newPTData.lua',GameInfo.dataDir .. '/Resources/scripts/pet_team/newPTPet.lua','/data/data/com.funplus.familyfarm/Resources/scripts/pet_team/ptHUDIcon.lua'}
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_PallonSpeed.txt") then
    pallon = gg.alert("⁉️ تـركـيـب مـــلـف تـسـريــع المــنـطـاد؟!.","✔ تــركـيـب ✔",""," رجـــوع ↩️")
    
    if pallon == 1 then 
        for i=1, #urls do
	    local getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		file:close()
		end
        gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
        -- إنشاء الملف stars_PallonSpeed.txt
        local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_PallonSpeed.txt", "w")
        file:write("Pallon Speed Done ✔")
        file:close()
        close()
    elseif pallon == 2 then 
        speed_luck()
    end
else
    pallon = gg.alert("💫 لــقـد قــمــت بتــركـيـب المـــلـف بنــجــاح 💫","✘ إلــغــاء تــركـيـب ✘",""," رجـــوع ↩️")
    
    if pallon == 1 then 
        for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_PallonSpeed.txt") -- حذف الملف stars_hospital.txt
        close()
    elseif pallon == 2 then speed_luck()
    end
end
end
---------تركيب ملف الحظ----------
function file_luck() gg.setVisible(false)
	local urls={'https://dl.dropboxusercontent.com/scl/fi/tv57qex9i97itd9h82gnn/util.lua?rlkey=1tq4exptyz5kbi69ojggbkh6j&dl=0', 'https://dl.dropboxusercontent.com/scl/fi/4gqof86zc3g27jt18uolw/switch.lua?rlkey=p1hds9vdjfrf02k3p3qxesyio&dl=0',}
	local files={GameInfo.dataDir .. '/Resources/scripts/common/util.lua', GameInfo.dataDir .. '/Resources/scripts/common/switch.lua',}
for i=1, #urls do
local getalldata= (gg.makeRequest(urls[i]).content)
	file = io.open(files[i], "wb")
	file:write(getalldata)
	io.close(file)
	end
	gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
	-- إنشاء الملف stars_lucky.txt
	local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_lucky.txt", "w")
        file:write("lucky Done ✔")
        file:close()
        close()
end
---------حذف ملف الحظ---------
function rm_file_luck() gg.setVisible(false)
       local files={GameInfo.dataDir .. '/Resources/scripts/common/util.lua', GameInfo.dataDir .. '/Resources/scripts/common/switch.lua',}
for i=1 ,#files do
os.remove(files[i])
end
gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_lucky.txt") -- حذف الملف stars_lucky.txt
close () 
end
----------------------------------HOME_animals(3)-----------------------------------------------------------
function animals() gg.setVisible(false)
choices = gg.choice(list_choices,nil,header)
if choices == nil then ex(3) end
if choices  == 1  then m3() end
if choices  == 2  then NOGOM('81001~81033;1::60',64,'1',9999,'0',1,1,1,1) end
if choices  == 3  then NOGOM('1E;1072693248D;3D;1175D::17',64,'1',9999,'2',1,1,1,1) end
if choices  == 4  then gg.alert(Superfood) NOGOM('161;50',64,'50',9999,'0',1,1,1,1) end
if choices  == 5 then HOME() end
ex(3)
end
------------------------
function m3() gg.setVisible(false)
choices = gg.choice(clothes_list,nil,header)
if choices == nil then ex(9) end 
if choices  ==  1 then mm1() end
if choices  ==  2 then mm2() end
if choices  ==  3 then mm3() end
if choices  ==  4 then mm4() end
if choices  ==  5 then mm5() end
if choices  ==  6 then mm6() end
if choices  ==  7 then animals() end
ex(9)
end
-------------------------------------------------------------------- 
function mm1() gg.setVisible(false)
mo = gg.choice(choices_1,nil,header)
if mo == nil then ex(9)end 
if mo  == 1  then NOGOM('83002',64,nil,1700,'86004',1,nil,1,1) end
if mo  == 2  then NOGOM('83002',64,nil,1700,'86005',1,nil,1,1) end
if mo  == 3  then NOGOM('83002',64,nil,1700,'86006',1,nil,1,1) end
if mo  == 4  then NOGOM('83002',64,nil,1700,'86007',1,nil,1,1) end
if mo  == 5  then NOGOM('83002',64,nil,1700,'86008',1,nil,1,1) end
if mo  == 6  then NOGOM('83002',64,nil,1700,'86009',1,nil,1,1) end
if mo  == 7  then m3() end
ex(9)
end
---------------------------------------------------------------------------------
function mm2() gg.setVisible(false)
oo = gg.choice(choices_1,nil,header)
if oo == nil then ex(9) end
if oo  == 1  then NOGOM('83002',64,nil,1700,'87006',1,nil,1,1) end
if oo  == 2  then NOGOM('83002',64,nil,1700,'87007',1,nil,1,1) end
if oo  == 3  then NOGOM('83002',64,nil,1700,'87008',1,nil,1,1) end
if oo  == 4  then NOGOM('83002',64,nil,1700,'87009',1,nil,1,1) end
if oo  == 5  then NOGOM('83002',64,nil,1700,'87010',1,nil,1,1) end
if oo  == 6  then NOGOM('83002',64,nil,1700,'87011',1,nil,1,1) end
if oo  == 7  then m3()end
ex(9)
end
-----------------------------------------------------------------------
function mm3() gg.setVisible(false)
oo = gg.choice(choices_2,nil,header)
if oo == nil then ex(9) end
if oo  == 1  then NOGOM('83002',64,nil,1700,'85003',1,nil,1,1) end
if oo  == 2  then NOGOM('83002',64,nil,1700,'85004',1,nil,1,1) end
if oo  == 3  then NOGOM('83002',64,nil,1700,'85005',1,nil,1,1) end
if oo  == 4  then NOGOM('83002',64,nil,1700,'85006',1,nil,1,1) end
if oo  == 5  then NOGOM('83002',64,nil,1700,'85007',1,nil,1,1) end
if oo  == 6  then NOGOM('83002',64,nil,1700,'85008',1,nil,1,1) end
if oo  == 7  then NOGOM('83002',64,nil,1700,'85009',1,nil,1,1) end
if oo  == 8  then m3() end
ex(9)
end
-----------------------------------------------------------
function mm4() gg.setVisible(false)
o1o = gg.choice(choices_4,nil,header)
if o1o == nil then ex(9) end
if o1o  == 1  then NOGOM('83002',64,nil,1700,'85002',1,nil,1,1) end
if o1o  == 2  then NOGOM('83002',64,nil,1700,'85003',1,nil,1,1) end
if o1o  == 3  then NOGOM('83002',64,nil,1700,'85004',1,nil,1,1) end
if o1o  == 4  then NOGOM('83002',64,nil,1700,'85005',1,nil,1,1) end
if o1o  == 5  then NOGOM('83002',64,nil,1700,'85006',1,nil,1,1) end
if o1o  == 6  then NOGOM('83002',64,nil,1700,'85007',1,nil,1,1) end
if o1o  == 7  then NOGOM('83002',64,nil,1700,'85008',1,nil,1,1) end
if o1o  == 8  then NOGOM('83002',64,nil,1700,'85009',1,nil,1,1) end
if o1o  == 9  then NOGOM('83002',64,nil,1700,'85010',1,nil,1,1) end
if o1o  == 10 then NOGOM('83002',64,nil,1700,'85011',1,nil,1,1) end
if o1o  == 11 then NOGOM('83002',64,nil,1700,'85012',1,nil,1,1) end
if o1o  == 12 then NOGOM('83002',64,nil,1700,'85013',1,nil,1,1) end
if o1o  == 13 then NOGOM('83002',64,nil,1700,'85014',1,nil,1,1) end
if o1o  == 14 then NOGOM('83002',64,nil,1700,'85015',1,nil,1,1) end
if o1o  == 15 then m3() end
ex(9)
end
------------------------------------------------------------------------------
function mm5() gg.setVisible(false)
oo = gg.choice(choices_2,nil,header)
if oo == nil then ex(9) end
if oo == 1 then NOGOM('83002',64,nil,1700,'84004',1,nil,1,1) end
if oo == 2 then NOGOM('83002',64,nil,1700,'84005',1,nil,1,1) end
if oo == 3 then NOGOM('83002',64,nil,1700,'84006',1,nil,1,1) end
if oo == 4 then NOGOM('83002',64,nil,1700,'84007',1,nil,1,1) end
if oo == 5 then NOGOM('83002',64,nil,1700,'84008',1,nil,1,1) end
if oo == 6 then NOGOM('83002',64,nil,1700,'84009',1,nil,1,1) end
if oo == 7 then m3() end
ex(9)
end
----------------------------------------------------------
function mm6() gg.setVisible(false)
oo = gg.choice(choices_3,nil,header)
if oo == nil then ex(9) end
if oo  == 1  then NOGOM('83002',64,nil,1700,'88004',1,nil,1,1) end
if oo  == 2  then NOGOM('83002',64,nil,1700,'88005',1,nil,1,1) end
if oo  == 3  then NOGOM('83002',64,nil,1700,'88006',1,nil,1,1) end
if oo  == 4  then m3() end
ex(9)
end
----------------------------------------HOME_special_tasks(4)----------------------------------------------------------

function special_tasks() gg.setVisible(false)
speci = gg.choice(other_tasks,nil,header)
if speci == nil then ex(4)end
if speci ==  1  then daily_tasks() end --المهام اليومية
if speci ==  2  then hospital() end --المشفي
if speci ==  3  then factories() end --الغاء تحميل المصانع
if speci ==  4  then NOGOM('1E;3E;2E;20E;4E;5E;6E;14E::999',64,'1',100,'0',1,1,1,1)  end --فتح ثلاث نجوم الزوار
if speci ==  5  then NOGOM('467D;1E::5',64,'1',100,'0',1,1,1,1) NOGOM('36;162;1095',64,nil,100,'0',1,nil,1,1) end -- جوازات السفر ب 0 نقود
if speci ==  6  then NOGOM('8,245,935,277,855,761,735',32,nil,10000 ,'0', 1,nil,1,1) NOGOM('h6572726F72',1,nil,10000 ,'0', 1,nil,1,1) end -- تدمير الخطأ
if speci ==  7  then NOGOM('1;10;60',64,'1',100,'0',1,1,1,1) end --المجتمع
if speci ==  8  then NOGOM('80;600;1800',4,nil,100,'0',1,nil,1,1) end --فتح ثلاث نجوم آلات الجزيرة
if speci ==  9  then HOME() end
ex(4)
end
----------------- المهام اليومية------------------
function daily_tasks() gg.setVisible(false)
	local urls={'https://bit.ly/3UvJomr','https://bit.ly/3QfJR9F','https://bit.ly/4aK7vDy','https://bit.ly/44bUNe6',}
	local files={GameInfo.dataDir .. '/Resources/scripts/daily_quest/controller.lua',GameInfo.dataDir .. '/Resources/scripts/daily_quest/data.lua',GameInfo.dataDir .. '/Resources/scripts/daily_quest/launcher.lua',GameInfo.dataDir .. '/Resources/scripts/daily_quest/questCell.lua',}
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/Stars_DailyQuest.txt") then 
	daily = gg.alert("⁉️ تـركـيـب مـــلـف المـهـام اليــومـيـة؟!.","✔ تــركـيـب ✔",""," رجـــوع ↩️")
	if daily == 1 then
		for i=1, #urls do
	    local getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		io.close(file)
		end
		gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
		-- انشاء ملف Stars_DailyQuest.txt
		file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/Stars_DailyQuest.txt", "wb")
		file:write("DailyQuest Done ✔")
  	  file:close()
 	   close ()
    elseif daily == 2 then special_tasks() end
else
	daily = gg.alert("💫 لــقـد قــمــت بتــركـيـب المـــلـف بنــجــاح 💫","💥 تـفــعـيـل 💥","✘ إلــغــاء تــركـيـب ✘"," رجـــوع ↩️")
	if daily == 1 then
		NOGOM("27000~27099E;1~2000E",64, "1~2000",500,"0",1,1,1,1)
	elseif daily == 2 then
		for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/Stars_DailyQuest.txt") -- حذف الملف Stars_DailyQuest.txt
        close()
	elseif daily == 3 then special_tasks() end
end

end
----------------المشفي--------------------
function hospital() gg.setVisible(false)
	local urls={'https://bit.ly/3WcbYdv'}
	local files={GameInfo.dataDir .. '/Resources/scripts/common/LuaMgr.lua'}
if GameInfo.x64 == false then 
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_Hospital.txt") then
    hosp = gg.alert("⁉️ تـركـيـب مـــلـف المـشـفـي؟!.","✔ تــركـيـب ✔",""," رجـــوع ↩️")
    if hosp == 1 then 
        for i=1, #urls do
	    local getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		io.close(file)
		end
        gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
        -- إنشاء الملف stars_hospital.txt
        local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_Hospital.txt", "w")
        file:write("Hospital Done ✔")
        file:close()
        close()
    elseif hosp == 2 then special_tasks() end
else
    hosp = gg.alert("⁉️ لــقـد قــمــت بتــركـيـب المـــلـف بنــجــاح؟!.","💥 تـفــعـيـل 💥","✘ إلــغــاء تــركـيـب ✘"," رجـــوع ↩️")
    
    if hosp == 1 then 
        NOGOM('3E;49285D::13',64,'3',300,'4',1,1,1) 
    elseif hosp == 2 then 
    	for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_Hospital.txt") -- حذف الملف stars_hospital.txt
        close()
    elseif hosp == 3 then special_tasks() end
end
else
req32 = gg.alert("‼️ هــذه التـفـعـيـلـة لا تــعمـل عــلي نـظــام 64BIT.\n يـجـب تـحـمـيـل نــظـام 32BIT أولاً.","✔ الـذهــاب إلـي مـتـجـر التـطـبـيـقـات ✔","","✘ إلــغــاء ✘")
if req32 == 1 then appStore()
else special_tasks() end
end
end
-------------الغاء تحميل المصانع---------------
function factories() gg.setVisible(false)
	local urls={'https://bit.ly/49Rw8gj','https://bit.ly/3U7K4wR',}
	local files={GameInfo.dataDir .. '/Resources/scripts/production_house/controller.lua',GameInfo.dataDir .. '/Resources/scripts/production_house/materialCell.lua',}
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_factories.txt") then
    factory = gg.alert("⁉️ تـركـيـب مـــلـف إلغــاء تـحـمـيـل المــصانــع؟!.","✔ تــركـيـب ✔",""," رجـــوع ↩️")
    if factory == 1 then 
        for i=1, #urls do
	    local getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		io.close(file)
		end
        gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
        -- إنشاء الملف stars_factories.txt
        local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_factories.txt", "w")
        file:write("Factories Done ✔")
        file:close()
        close()
    elseif factory == 2 then special_tasks() end
else
    factory = gg.alert("💫 لــقـد قــمــت بتــركـيـب المـــلـف بنــجــاح 💫","✘ إلــغــاء تــركـيـب ✘",""," رجـــوع ↩️")
    if factory == 1 then 
    	for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_factories.txt") -- حذف الملف stars_factories.txt
        close()
    elseif factory == 2 then special_tasks() end
end
end
------------------------------------------HOME_BUY(5)-------------------------------------------------------------------------------------------------
    asd1 = "18;3;20;2"
    asd2 = "3;2"
    asd3 = "18;999999;20;999999"
function buy() gg.setVisible(false)
tc2p_ch = gg.choice (list_buy,nil,header)
if tc2p_ch == nil then ex(5)  end
if tc2p_ch == 1 then action (fishes) end
if tc2p_ch == 2 then action (special_p) end
if tc2p_ch == 3 then action (rare_p) end
if tc2p_ch == 4 then action (lucky_p) end
if tc2p_ch == 5 then action (island_p) end
if tc2p_ch == 6 then action (locked_p) end
if tc2p_ch == 7 then with_code () end
if tc2p_ch == 8 then REVERT_SEARCH(revv_t)  REVERT_SEARCH(revv2_t)  REVERT_SEARCH(revv3)end
if tc2p_ch == 9 then HOME() end
ex(5)
end
------------------شراء المنتجات--------------------
function action ( arr ) 
       list={}
      selected ={}
	   for k, v in pairs(arr) do
			table.insert(list, k) 
		end
		table.sort(list)
		table.insert(list, ' رجوع↩️ ')
	    BE = gg.multiChoice(list, nil,header) 
	    ch_list={} 
	     if BE == nil then
	        ex(5)
	     end
	     if BE[#list] then
	           buy ()
	     end
	    for i=1, #list-1 do
			if BE[i] then
			   table.insert(ch_list,  arr[list[i]]) 
			end
		end
	    for i=1, #ch_list do
		     if ch_list[i] then table.insert(selected, i) end
        end
      g=asd1
	  d=asd2
	  s=asd3
	  gg.alert(moqed)
	  gg.setVisible(false)
	  gg.searchNumber(g ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  if #selected == 1 then
	     gg.refineNumber("3" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  else
	     gg.refineNumber(d ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	 end
	  rev = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
	  revv_t = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
	  if #rev == 0 or #revv_t == 0 then
    	gg.alert(search_again)
		end
	  gg.editAll(999999, gg.TYPE_DOUBLE)
	  gg.clearResults()
	  gg.setVisible(false)
      gg.searchNumber("18;999999" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  gg.refineNumber("18" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
      revv2 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	  revv2_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	  if #revv2 == 0 or #revv2_t == 0 then
    	gg.alert(search_again)
    	return
		end
	  gg.editAll(ch_list[selected[1]], gg.TYPE_DOUBLE)
	  gg.clearResults()
	  revv3=revv2_t
	   if #selected > 1 then
	    gg.setVisible(false)
	    gg.searchNumber("20;999999" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    gg.refineNumber("20" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    revv3 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	    revv3_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	    if #revv3 == 0 or #revv3_t == 0 then
    	gg.alert(search_again)
    	return
		end
	   gg.editAll(ch_list[selected[2]], gg.TYPE_DOUBLE)
	   gg.clearResults()
	   end
end
------------------شراء بالكود----------------------
function with_code() gg.setVisible(false)
 gg.alert(moqed) 
coder=gg.prompt({"🔍ابحث بالكود🔎","??ابحث بالكود2🔎"},{'',''},{[1]='number'})
if coder == nil then buy() end
gg.setVisible(false)
	  gg.searchNumber("18;3;20;2",gg.TYPE_DOUBLE,false,536870912,0,-1,0)
if coder[2]=="" then
    gg.refineNumber("3" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	   else
  gg.refineNumber("3;2" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	end
 revv = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
 revv_t = gg.getResults(16000, nil, nil, nil, nil, nil, nil, nil, nil)
 if #rev == 0 or #revv_t == 0 then
    	gg.alert(search_again)
    	return
		end
 gg.editAll(55555, gg.TYPE_DOUBLE)
	  gg.clearResults()
	  gg.setVisible(false)
      gg.searchNumber("18;55555" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	  gg.refineNumber("18" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
      revv2 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	  revv2_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
      if #revv2 == 0 or #revv2_t == 0 then
    	gg.alert(search_again)
    	return
		end
      gg.editAll(coder[1], gg.TYPE_DOUBLE)
	  gg.clearResults()
	if coder[2] ~= "" then
	  revv3=revv2_t
	gg.setVisible(false)
	    gg.searchNumber("20;55555" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    gg.refineNumber("20" ,gg.TYPE_DOUBLE,false,536870912,0,-1,0)
	    revv3 = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
	    revv3_t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
        if #revv3 == 0 or #revv3_t == 0 then
    	gg.alert(search_again)
    	return
		end
        gg.editAll(coder[2], gg.TYPE_DOUBLE)
	    gg.clearResults()
end
end
---------------------ارجاع البحث------------------
function REVERT_SEARCH(rev) 
  gg. setValues(rev)
end
--------------------------------------------HOME_PALANtS(6)----------------------------------------------------------------------------------------------------------
function plants() gg.setVisible(false)
lib = gg.choice(cultivation,nil,header)
if lib == nil then ex(6)end
if lib==1  then NOGOM ('20026',4,nil,2000,'5101',1,nil,1,1) end
if lib==2  then NOGOM ('20026',4,nil,2000,'5103',1,nil,1,1) end
if lib==3  then NOGOM ('20026',4,nil,2000,'5105',1,nil,1,1) end 
if lib==4  then NOGOM ('20026',4,nil,2000,'5107',1,nil,1,1) end 
if lib==5  then NOGOM ('20026',4,nil,2000,'5117',1,nil,1,1) end 
if lib==6  then NOGOM ('20026',4,nil,2000,'5119',1,nil,1,1) end 
if lib==7  then NOGOM ('20026',4,nil,2000,'5121',1,nil,1,1) end
if lib==8  then NOGOM ('20026',4,nil,2000,'5109',1,nil,1,1) end
if lib==9  then NOGOM ('20026',4,nil,2000,'5111',1,nil,1,1) end
if lib==10 then NOGOM ('20026',4,nil,2000,'5113',1,nil,1,1) end
if lib==11 then NOGOM ('20026',4,nil,2000,'5115',1,nil,1,1) end
if lib==12 then NOGOM ('20026',4,nil,2000,'5123',1,nil,1,1) end
if lib==13 then NOGOM ('20026',4,nil,2000,'5125',1,nil,1,1) end
if lib==14 then NOGOM ('20026',4,nil,2000,'5127',1,nil,1,1) end
if lib==15 then NOGOM ('20026',4,nil,2000,'7046',1,nil,1,1) end
if lib==16 then gg.alert (ananola)NOGOM ('7014',4,nil,2000,'7048',1,nil,1,1) end
if lib==17 then HOME() end
ex(6)
end 
-----------------------------------------HOME_changeFarms(7)--------------------------------------------------------------------------------------------------------------------------------------
function changeFarms() gg.setVisible(false)
		FF_Choice ()
	end
		Contents = {}
		local UF
		invalidChar= '*/\':?|<>'
		function FF_Choice ()
		if string.find(GameInfo.cmdLine,'tango')  
			then
				 UserMenuFile = '/data/data/FT Accounts.txt'
		else
			UserMenuFile = '/data/data/FF Accounts.txt'
		end
		
		FF_UserDefult = GameInfo.dataDir .. '/files/UserDefault.xml'
		FF_Users()
		end
	function FF_Users()
		  DataFetch()
        if not file_exists("/data/data/Current Farm.txt") then
        headerL_C = "╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰═══✬☞ƈᴜʀʀᴇɴᴛ ѕтαяѕ тєαм ʄᴀʀᴍ☜✬═══✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝"
        else
        file = io.open("/data/data/Current Farm.txt", "r")
     				   NameFH = file:read("*a")
    				    file:close()
        headerL_C = "╔═❥❣✰════════════✬⋆✪⋆✬════════════✰❣❥═╗\n✿❣✰═══✬☞ƈᴜʀʀᴇɴᴛ " .. NameFH .. " ʄᴀʀᴍ☜✬═══✰❣✿\n╚═❥❣✰═════════✬⋆ ELNGOME ⋆✬═════════✰❣❥═╝"
        end
		  local MenueCh
		  MenueCh = gg.choice (list_change, nil, headerL_C)
	    if MenueCh == nil then ex(7)else
		if MenueCh == 1 then FileExport_p1() end
		if MenueCh == 2 then OpenUserFromFile() end
		if MenueCh == 3 then UsersMenu() end
	    if MenueCh == 4 then DeleteUsers() end
		if MenueCh == 5 then HOME() end
		end --Endelse
		ex(7)
		end -- EndFun.
		
		function DataFetch()
		
		   if next(Contents) ~= nil
			 then 
				for i = 1 ,#Contents do
				   Contents[i] = nil
				end --EndFor
		   end --EndIF
		  
		   UF = io.open(UserMenuFile, 'r')
		   if UF ~= nil
			  then  
			  for line in UF:lines()
				do
				   Contents [#Contents + 1] = tostring(line)
			 end --Endfor
			  UF:close()           
		   end --EndIf    
		   
		end
		
		function FileTransfer(Sorce, Destination)
			
			UF , error = io.open(Sorce,'r')
			if UF ~= nil
				then
				  str=io.open(Sorce,'r'):read('*a') 
					io.open(Destination,'w'):write(str) 
					gg.alert('✔ تــــم النـقــــل')
					UF:close()
					return 'true'
				else
				   --gg.alert('الملف غير موجود')
					  gg.alert('مــلـف اليـــوزر غيــر مــوجــود او ان المــحـاكــي لا يــسـمـح بـقــراءتــه ✖️\n'..error)
					  return 'false'
			   end--EndIf
		   
		 end
		
		function FileExport_p1()
		 
		 local err = 'False'
		  NotAllowed = {}
		  for i = 1, #invalidChar do
			 NotAllowed[i] = invalidChar : sub(i, i)
		   end
		
		   UI=gg.prompt
				 (
				   {'🌟 قـم بـتـسـمـيـــة المزرعة :'},
				   {[1]=''},{[1]='text'}
				 )
			if UI == nil
			   then 
			else--1
			   if UI[1] =='' or UI[1]==' ' then 
				 gg.alert ('❔ رجـــاءً قــم بـإدخــال الإســم أولاً ..')
			   else --2
				  for i = 1,#NotAllowed do
					if string.match(UI[1],NotAllowed[i])
					  then 
						 err = 'True'
						 gg.alert('🚫 خـطـاء فـي الـتـسـمـية .. قـم بـتـسـمـية المزرعة بدون اسـتـخدام احد هذه الرمــوز : \n'..invalidChar)
						 break
					  end--IF
				   end--FOR
				  if err == 'False' then FileExport_p2(UI[1]) end
				end--Else2      
			end--Else1
		end
		
		function FileExport_p2(Fname)
		
			local FF_UserFileName = ''
			local size = #Contents
		   IsExest = ''  
		   if size ~= 0 
			 then
				for i = 1 ,#Contents do
					if Contents[i] == Fname
						then 
						   IsExest = 'True'
						   break
					  else
						   IsExest = 'False'
					end --Else
				 end --FOR
			end--IF
		
		   if IsExest == 'False' or size == 0
			  then 
				 FF_UserFileName ='/data/data/'.. Fname..'.xml'
				 local OK = FileTransfer(FF_UserDefult, FF_UserFileName)
				 if OK == 'false'
				   then
				 else 
					   table.insert(Contents,Fname)
					   UF , error= io.open(UserMenuFile, 'a+')
					   UF:write(Fname,'\n')
					   UF:close()
				 end
			end --IF
		
		   if IsExest == 'True'
			   then
				 msg = gg.alert('❗توجد مزرعة اخرى تحمل نفس الاسم .. هل تريد  استبدالها بالمزرعة الجديدة؟ ','اسـتـبــــدال','','إلـغـــاء')
				 if msg == nil
					 then
				 else --Else2
					 if msg == 1 then
						FF_UserFileName = Fname..'.xml'
						FileTransfer(FF_UserDefult, FF_UserFileName)
					end
					 if msg == 3 then
						 FF_Users()  
					 end
				  end --EndElse2 
		   end --EndIF 
		local saveToPhone = gg.alert('⁉️ هـل تـريـد حـفـظ نـسـخــة مـــن اليـــوزر فــي ذاكــرة الــهـاتــف؟', 'نعــــــــــــم ✔', 'لا ❌')
  	  local savePath = ''  -- سيتم حفظ المسار الذي يختاره المستخدم هنا
    
   		 if saveToPhone == 1 then
     		   -- طلب المسار من المستخدم
      		  local UI = gg.prompt({'📂 برجـــاء اخـتـيـار الـمـجـلـد الـذي تــريـد حـفـظ اليـــوزر بــه :'}, {gg.EXT_STORAGE}, {'path'})
        
      		  if UI and UI[1] ~= '' then
          		  savePath = UI[1]
    		    else
    		        gg.alert('⛔ لــم يــتـم إدخــــال المــســار ... لــن يــتـم حــفــظ اليـــوزر فــي ذاكــرة الــهـاتــف ⛔')
     	       return
  	      end
 		-- حفظ اليوزر في المسار المحدد
        local FF_UserFileName = savePath .. '/' .. Fname .. '.xml'
        FileTransfer(FF_UserDefult, FF_UserFileName)
        gg.alert('✔️ تــم حـفـظ الــيوزر بـنـجـاح فــي الـمــسـار الـتـالــي:\n📂 ' .. savePath)
    end
end

		function OpenUserFromFile()
    local path = gg.prompt({"📂 برجــــاء اخـتــيـار يـــوزر الــمزرعـــة المــــراد فـتـحـهــا  :"},{gg.EXT_STORAGE},{"file"})
    if path == nil or path[1] == '' or not string.match(path[1], "%....$") then
        gg.alert('⛔ لـــم يـتــم اخــتــيــار مـلــف يــوزر المــزرعــة ⛔')
    elseif not string.match(path[1], "%.xml$") then
    	gg.alert('⛔ المـلــف المــخـتـار غـيــر صـــالح ... يــرجـى اخـتـيـار مـلـــف بامــتــداد .xml ⛔')
    else
		local choice = gg.alert('‼️هـــل تــريـد حــفــظ اليـــوزر ضـمـن قـــائـمـة اليـــوزارات ام تــريـد فــتـحـه؟!', 'حــفـــظ','', 'فــتــح ')
        if choice == 1 then
        local err = 'False'
		  NotAllowed = {}
		  for i = 1, #invalidChar do
			 NotAllowed[i] = invalidChar : sub(i, i)
		   end
		
		   Fname=gg.prompt
				 (
				   {'🌟 قـم بـتـسـمـيـــة المزرعة :'},
				   {[1]=''},{[1]='text'}
				 )
			if Fname == nil
			   then 
			else--1
			   if Fname[1] =='' or Fname[1]==' ' then 
				 gg.alert ('❔ رجـــاءً قــم بـإدخــال الإســم أولاً ..')
			   else --2
				  for i = 1,#NotAllowed do
					if string.match(Fname[1],NotAllowed[i])
					  then 
						 err = 'True'
						 gg.alert('🚫 خـطـاء فـي الـتـسـمـية .. قـم بـتـسـمـية المزرعة بدون اسـتـخدام احد هذه الرمــوز : \n'..invalidChar)
						 break
					  end--IF
				   end--FOR
				  if err == 'False' then 
					local FF_UserFileName = ''
			local size = #Contents
		   IsExest = ''  
		   if size ~= 0 
			 then
				for i = 1 ,#Contents do
					if Contents[i] == Fname[1]
						then 
						   IsExest = 'True'
						   break
					  else
						   IsExest = 'False'
					end --Else
				 end --FOR
			end--IF
		
		   if IsExest == 'False' or size == 0
			  then 
				 FF_UserFileName ='/data/data/'.. Fname[1] ..'.xml'
				 local OK = FileTransfer(path[1], FF_UserFileName)
				 if OK == 'false'
				   then
				 else 
					   table.insert(Contents,Fname[1])
					   UF , error= io.open(UserMenuFile, 'a+')
					   UF:write(Fname[1],'\n')
					   UF:close()
				 end
			end --IF
		
		   if IsExest == 'True'
			   then
				 msg = gg.alert('❗توجد مزرعة اخرى تحمل نفس الاسم .. هل تريد  استبدالها بالمزرعة الجديدة؟ ','اسـتـبــــدال','','إلـغـــاء')
				 if msg == nil
					 then
				 else --Else2
					 if msg == 1 then
						FF_UserFileName = Fname[1]..'.xml'
						FileTransfer(path[1], FF_UserFileName)
					end
					 if msg == 3 then
						 FF_Users()  
					 end
				  end --EndElse2 
		   end --EndIF 
				 end
				end--Else2      
			end--Else1
        elseif choice == 2 then
        	Srce = path[1]
			Destin = FF_UserDefult
			FileTransfer(Srce, Destin)
			gg.alert('ســوف يــتــم اغـــــلاق اللــعـبـه الان ✖️⛔')
			gg.processKill ()
		else return
        end
        end
    end
    
		function UsersMenu()
    local Menu = {}
    local MenueCh
    if next(Contents) == nil then
        gg.alert('🚫 لا توجد مزارع حالياً ..  ')
    else
        for i = 1, #Contents do 
            -- تعديل العناصر في القائمة بإضافة رموز أو ترقيم
            Menu[#Menu + 1] = "『" .. i .. "』〘 💫 " .. Contents[i] .. " 💫 〙"
        end
        
        table.insert(Menu, 'رجــــوع ↩️')
        
        MenueCh = gg.choice(
            Menu,
            nil,
            headerL_C
        )
        
        if MenueCh == nil then
        else
            if MenueCh == #Menu then 
                FF_Users() 
            else 
                for i = 1, #Contents do
                    -- تجاهل الرموز أو الترقيم عند البحث عن العنصر المختار
                    local name = string.match(Menu[MenueCh], "『%d+』〘 💫 (.+) 💫 〙")
                    if MenueCh == i then 
                        Srce = '/data/data/'.. name .. '.xml'
                        Destin = FF_UserDefult
                        FileTransfer(Srce, Destin)
                        -- إنشاء ملف يحتوي على اسم المستخدم الذي تم نقله
                        local currentFarm= io.open("/data/data/Current Farm.txt", "w")
                        currentFarm:write("✨ " .. name .. " ✨")
                        currentFarm:close()
                        gg.alert('ســوف يــتــم اغـــــلاق اللــعـبـه الان ✖️⛔')
                        gg.processKill ()
                        break
                    end
                end
            end
        end
    end
end
		
		function DeleteUsers()
    local Menu = {}
    local MenueCh
    
    if next(Contents) == nil then
        gg.alert('🚫 لا توجد مزارع حالياً ..  ')       
    else
        for i = 1, #Contents do 
            Menu[#Menu + 1] = Contents[i]
        end
        
        table.insert(Menu, 'رجــــوع ↩️')
        
        MenueCh = gg.multiChoice(
            Menu,
            nil,
            headerL_C
        )
        
        if MenueCh == nil then       
        else
            local delt = #Menu - 1
            local kk = #Menu - 1
            for i = kk, 1, -1 do
                if MenueCh[i] == true and i ~= 0 then 
                    -- استخدام النمط المحدد مسبقًا لتحديد اسم المستخدم
                    local Srce = '/data/data/' .. Menu[i] .. '.xml'
                    os.remove(Srce)
                    table.remove(Menu, i)
                    kk = kk - 1
                end
            end
            if delt ~= #Menu - 1 then 
                local UF = io.open(UserMenuFile, 'w')
                for i = 1, #Menu - 1 do 
                    UF:write(Menu[i], '\n')
                end
                UF:close()
                gg.alert('✔ تـم الـحـــذف ...')
            end

            if MenueCh[#Menu] == true then 
                FF_Users() 
            end
        end
    end
end
-------------------------------------------HOME_App_Store(8)------------------------------------------------------------------------------------------------------------------------
function appStore() gg.setVisible(false)
   --  gg.alert("⛔️ سيتم اعادة فتحها قريبا ⛔️") HOME()
     gg.alert(msgExs)
   store()
   end
   function store() gg.setVisible(false)
selectedOption = #urls_name -- رقم الموقع لاختيار "رجوع"
-- وظيفة لتحميل الملف
local function downloadFile(selectedUrl, selectedName)
    local fileDown = "✨ لقد قمت بتحميل الملف من قبل، يرجي تثبيته ✨\n✨ ستجد الملف في هذا المسار 👈👈 " .. DownloadPath.. " ✨\n✨ اسم الملف:- " .. selectedName .. " ✨"
    local fileExists = io.open(DownloadPath .. selectedName, "r")
    
    if fileExists then
        io.close(fileExists)
        gg.alert(fileDown)
    else
        local Time = os.clock()
        getalldata = gg.makeRequest(selectedUrl).content
        
        if getalldata == nil then
            gg.toast('⚠️ حدثت مشكلة أثناء التنزيل. يرجى المحاولة مرة أخرى.')
            return os.exit()
        end
        
        local file = io.open(DownloadPath .. selectedName, "w")
        file:write(getalldata)
        io.close(file)
        gg.toast("تم التنزيل بنجاح ✔️")
        gg.sleep(2500)
        gg.toast("المسار :" .. DownloadPath)
        gg.sleep(2500)
        gg.toast("وقت التنزيل :" .. string.format("%.2f", os.clock() - Time) .. " ثانية")
        gg.sleep(2500)
        gg.alert("✨ مسار التنزيل:- "..DownloadPath.." ✨\n✨ اسم الملف:- "..selectedName.." ✨")
    end
end

while true do
    local displayedChoices = {}
    local searchIndex = 1 -- متغير لتتبع ترقيم العناصر في النتائج
    
    for i, name in ipairs(urls_name) do
        table.insert(displayedChoices, "『" .. searchIndex .. "』〘 " .. name .. " 〙")
        searchIndex = searchIndex + 1 -- زيادة ترقيم العنصر
    end
    
    local choice = gg.choice(displayedChoices, nil, headerStore)
    
    if choice == nil then
        ex(8)
    end
    
    if choice == selectedOption then
        HOME()
    elseif choice == 1 then
        local searchTerm = gg.prompt({'📝 الرجاء إدخال اسم التطبيق المراد البحث عنه :'}, {[1] = ''}, {[1] = 'text'})
        if searchTerm == nil then ex(8) end
        local searchString = searchTerm[1]
        if searchString == '' and ' ' and '.' and '  ' or searchString:match('^%s*$') then gg.alert('❌ إدخال خاطئ ... قم بإعادة البحث 🔁') ex(8) end
        local searchResults = {}
        
        for i, name in ipairs(urls_name) do
            if i > 1 and string.match(string.lower(name), string.lower(searchString)) then
                table.insert(searchResults, i)
            end
        end
        
        
        if #searchResults > 0 then
    -- عرض نتائج البحث
    local displayedResults = {}
    local resultIndex = 0
    for _, index in ipairs(searchResults) do
        resultIndex = resultIndex + 1
        table.insert(displayedResults, "『" .. resultIndex .. "』〘 " .. urls_name[index] .. " 〙")
    end

    -- إضافة خيار الرجوع
    resultIndex = resultIndex + 1
    table.insert(displayedResults, "『" .. resultIndex .. "』〘 رجوع 〙")

    local choice = gg.choice(displayedResults, nil, headerStore)
    if choice then
        if choice == resultIndex then
        else
            choice = searchResults[choice]
            -- تحميل الملف إذا تم اختياره من نتائج البحث
            downloadFile(urls[choice], names[choice])
        end
end
else gg.alert("‼️ لا يوجد نتائج مطابقة للبحث ... قم بإعادة البحث 🔁")
        end
    else
        ---- تحميل الملف إذا تم اختياره من القائمة الرئيسية
        downloadFile(urls[choice], names[choice])
    end
end -- END WHILE 
end -- END FUN
-------------------------------------------HOME_VIP(9)--------------------------------------------------------------------------------------------------------------------
function vip() gg.setVisible(false)
vipMenu = gg.choice(list_vip,nil,header)
if vipMenu == nil then ex(10) end
if vipMenu == 1 then koshk() end --الكشك
if vipMenu == 2 then farmium() end --شراء قارورة بنفسجية
if vipMenu == 3 then NOGOM('h 66 69 73 68 5F 6A 75 6D 70 5F 70 6F 77 65 72',1,nil,10000,'0',1,nil,1,1) NOGOM('h 66 69 73 68 5F 73 74 61 6D 69 6E 61 5F 67 72 6F 77 74 68',1,nil,10000,'0',1,nil,1,1) NOGOM('h 66 69 73 68 5F 6C 76 31',1,nil,10000,'h 66 69 73 68 5F 6C 76 33',1,nil,1,1) NOGOM('h 66 69 73 68 5F 6C 76 32',1,nil,10000,'h 66 69 73 68 5F 6C 76 33',1,nil,1,1) end --تثبيت صنارة الصيد بالمنتصف
if vipMenu == 4 then NOGOM('h 6C 69 6D 69 74 5F 63 6F 6E 66 69 67 5F 6E 65 77',1,nil,10000,'0',1,nil,1,1) end --فاعلية التلقائي
if vipMenu == 5 then NOGOM('500',64,nil,1000,'0',1,nil,1,1) NOGOM('1400',64,nil,1000,'0',1,nil,1,1) NOGOM('2500',64,nil,1000,'0',1,nil,1,1) NOGOM('2800',64,nil,1000,'0',1,nil,1,1) end --تخطي نقاط الجزيرة
if vipMenu == 6 then NOGOM('75;90::5',64,'75',1000,'999999999',1,1,1,1) end --طاقة النافورة
if vipMenu == 7 then HOME() end 
ex(10)
end
--------------فتح الكشك بعد غلقه-------------
function koshk() gg.setVisible(false)
gg.alert("")
promp2 = gg.prompt({"✰ ادخل عدد المنتجات الذي اغلق الكشك عندها ✰"},{""},{"number"})
if promp2 == nil then vip() end
NOGOM (promp2[1],64,nil,17000,'0',1,nil,1,1)
end
-------------شراء قارورة بنفسجية--------------
function farmium() gg.setVisible(false)
	local urls = {"https://bit.ly/3xTXN2X",}
	local files = {GameInfo.dataDir .. "/Resources/settings_conf/skill/skill.json",}
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_farmium.txt") then

    farmiu = gg.alert("⁉️ تـركـيـب مـــلـف شـــراء قــُارورة بـنـفـسـجـيـة؟!.","✔ تــركـيـب ✔",""," رجـــوع ↩️")
    if farmiu == 1 then 
        for i=1, #urls do
	    local getalldata= (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		file:close()
		end
        gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
        -- إنشاء الملف stars_farmium.txt
        local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_farmium.txt", "w")
        file:write("Factories Done ✔")
        file:close()
        close()
    elseif farmiu == 2 then vip() end
else
    farmiu = gg.alert("💫 لــقـد قــمــت بتــركـيـب المـــلـف بنــجــاح 💫","✘ إلــغــاء تــركـيـب ✘",""," رجـــوع ↩️")
    if farmiu == 1 then 
    	for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_farmium.txt") -- حذف الملف stars_farmium.txt
        close()
    elseif farmiu == 2 then vip() end
end
end
-------------------------------------------HOME(10)----------------------------------------------------------------------------------------------------------------------

function help_menu_2()

function get_index(arr, word)
	for index, item in ipairs(arr) do
	      if item == word then
		    return index
		  end
	end
end

function compareByStringLength(a, b)
  return #a > #b
end

function split_array(farray, array_1,array_2)
   for k, v in pairs(farray) do
      table.insert(array_1, k) 
      table.insert(array_2, v)
   end
end


function generateItems (arr1, arr2, ashta)gg.setVisible(false)
   local items = {}
   for i=1, #arr1 do
      table.insert(items, "✮"..arr1[i].."✮")
   end
   table.insert(items, " ✰ رجوع↩️ ✰") 
   return items
end
function sa_ad(ar1, ar2, nem)
    ar1= {}
    ar2= {}
    split_array(nem,ar1,ar2)
    arr1 = ar1
	arr2 = {}
	table.sort(arr1, compareByStringLength)
	for i=1, #arr1 do
	   table.insert(arr2, nem[arr1[i]])
	end
end
function categories()
	codes = gg.choice( generateItems(arr1, arr2,"✮🔍محرك البحث🔍✮"
	) , nil,header) 
	taken = ""
	
	if codes==nil then
	   HOME9() 
    elseif codes== #generateItems(arr1, arr2,"") then help_menu_2() 
	
	  else
 taken = arr2[codes]
	   gg.copyText(arr2[codes])
   end
end

function categories_edit()
   codes = gg.choice( generateItems(arr1, arr2,"✮⌨تعديل⌨✮") , nil,header) 
	taken_edit = ""
	if codes==nil then
	   HOME9() 
	end
	   taken_edit = arr2[codes]
	   gg.copyText(arr2[codes])
	
end
function home()
yellow_ak= gg.choice(Yellow_ak, nil,header) 
end

arr1 = {}
arr2 = {}
test = gg.choice(cod1 , nil,header) 
if test==nil then HOME9() end
if test == 1 then  end
if test == 2 then fa=Fa sa_ad(fa_1, fa_2, fa) categories()end
if test == 3 then Machine2=MAchine sa_ad(Machine2_1, Machine2_2, Machine2) categories()end
if test == 4 then animals=Animals sa_ad(animals_1,animals_2,animals) categories() end
if test == 5 then masar=Masar sa_ad(masar_1,masar_2,masar) categories() end
if test == 7 then mokhtpr=Mokhtpr sa_ad(mokhtpr_1,mokhtpr_2,mokhtpr) categories() end
if test== 8 then HOME9()  end
 if test == 6 then home() 
 if yellow_ak == nil then ex(9)end
 if yellow_ak == 1 then  so=th1 sa_ad(so_1,so_2,so) categories() end
 if yellow_ak == 2 then  fishes2=fishes1 sa_ad(fishes2_1,fishes2_2,fishes2) categories() end
 if yellow_ak == 3 then  khshb2=khshb1 sa_ad(khshb2_1,khshb2_2,khshb2) categories() end
 if yellow_ak == 4 then shhn2=shhn1 sa_ad(shhn2_1,shhn2_2,shhn2) categories() end
 if yellow_ak == 5 then  mtwer2=mtwer1 sa_ad(mtwer2_1,mtwer2_2,mtwer2) categories() end
 if yellow_ak == 6 then tgmil2=tgmil1 sa_ad(tgmil2_1,tgmil2_2,tgmil2) categories() end
 if yellow_ak == 7 then gthera2=gthera1 sa_ad(gthera2_1,gthera2_2,gthera2) categories() end
 if yellow_ak == 8 then  help_menu_2() end 
 end
gg.clearResults()
search = gg.prompt({"🔍ابحث بالكود🔎"},{[1]=taken},{[1]='number'})
if not search the﻿n help_menu_2() end 
taken = search[1]
search_code = ""
search_type = gg.alert("✮برجاء اختيار نوع البحث✮","[✮DWORD✮]","[✮DOUBLE✮]","[✮الغاء✮]")
if search_type == nil then
   HOME9()
elseif search_type == 1 then
   search_code = 4
elseif search_type == 2 then
   search_code = 64
else
   help_menu_2() 
end
gg.setVisible(false)
gg.searchNumber(search[1] , search_code, false, gg.SIGN_EQUAL, 0, -1, 0)
ref = 0
search_action = gg.alert("     ☟                                                                 ☟                     ☟","[✮تعديل✮]","[✮اعادة بحث✮]","[✮الغاء✮]")
if search_action == nil then
   help_menu_2() 
   elseif search_action == 3 then 
   help_menu_2() 
elseif search_action == 1 then 
   
elseif search_action == 2 then
   ref = 1

   search_refine = gg.prompt({"🔄كود اعاده البحث🔄"},{[1]=taken},{[1]='number'})
   if not search_refne the﻿n help_menu_2() end 

end

if ref ==1 then gg.refineNumber(search_refine[1] ,search_code,false,536870912,0,-1,0) end
local res = gg.getResults(gg.getResultsCount(), nil, nil, nil, nil, nil, nil, nil, nil)
test = gg.choice( cod , nil,header) 
if test==nil then help_menu_2() end
if test == 1 then  end
if test == 2 then fa=Fa sa_ad(fa_1, fa_2, fa) categories_edit()end
if test == 3 then Machine2=MAchine sa_ad(Machine2_1, Machine2_2, Machine2) categories_edit()end
if test == 4 then animals=Animals sa_ad(animals_1,animals_2,animals) categories_edit() end
if test == 5 then masar=Masar sa_ad(masar_1,masar_2,masar) categories_edit() end
if test == 7 then mokhtpr=Mokhtpr sa_ad(mokhtpr_1,mokhtpr_2,mokhtpr) categories_edit() end
if test== 8 then HOME9()  end
 if test == 6 then home() 
 if yellow_ak == nil then help_menu_2()end
 if yellow_ak == 1 then  so=LANG.th sa_ad(so_1,so_2,so) categories_edit() end
 if yellow_ak == 2 then  fishes2=fishes1 sa_ad(fishes2_1,fishes2_2,fishes2) categories_edit() end
 if yellow_ak == 3 then  khshb2=khshb1 sa_ad(khshb2_1,khshb2_2,khshb2) categories_edit() end
 if yellow_ak == 4 then shhn2=shhn1 sa_ad(shhn2_1,shhn2_2,shhn2) categories_edit() end
 if yellow_ak == 5 then  mtwer2=mtwer1 sa_ad(mtwer2_1,mtwer2_2,mtwer2) categories_edit() end
 if yellow_ak == 6 then tgmil2=tgmil1 sa_ad(tgmil2_1,tgmil2_2,tgmil2) categories_edit() end
 if yellow_ak == 7 then gthera2=gthera1 sa_ad(gthera2_1,gthera2_2,gthera2) categories_edit() end
 if yellow_ak == 8 then  help_menu_2() end 
 end
search_edit = gg.prompt({"🚫كود التعديل🚫"},{[1]=taken_edit},{[1]='number'})
if not search_edit the﻿n help_menu_2() end 
gg.editAll(search_edit[1], search_code)
gg.clearResults()
--else
gg.toast("✰تم التعديل✰")end
   
  --end

-----------------------------------------------------------------------------------------------------------
  function ex (z)gg.setVisible(false)
	THSH = -1
	gg.skipRestoreState()
	gg.setVisible(false)
	gg.toast("💚 لا تـنـســي الصـــلاة عـــلـي خــيــر الـــوَرَى ﷺ 💚")
    while true do
	    if gg.isVisible(true) then
		    THSH = 1
		    gg.setVisible(false)
	    end
	    if THSH == 1 then
	        gg.setVisible(true)
		    if     z == 1  then HOME_ALL()
		    elseif z == 2  then speed_luck()
		    elseif z == 3  then animals()
		    elseif z == 4  then special_tasks()
		    elseif z == 5  then buy()
		    elseif z == 6  then plants()
		    elseif z == 7  then changeFarms()
		    elseif z == 8  then store()
		    elseif z == 9  then m3()
			elseif z == 10 then vip()
		    else
	           HOME ()
	       end
	    end
	 end
end
-------------------------------
function Exit() gg.setVisible(false)
	local files = {GameInfo.dataDir .. "/Resources/scripts/common/game/syncErrorRumEvent.lua",}
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_anti.txt") then exit()
else
fileG = gg.alert("⁉️ هــل تـريـد حــذف مــلف عــدم فـصـل اللـعـبـة قـبـل الخــروج؟!.","✔ حــــــذف ✔","","✘ لا ✘")
if fileG == nil then exit()
elseif fileG == 1 then
		for i=1 ,#files do
		os.remove(files[i])
		end
		gg.toast("✔ تـــم حـــذف المـــلـف بنــجــاح ✔")
        os.remove(GameInfo.dataDir .. "/Resources/scripts/vip/stars_anti.txt")
        exit()
else exit()
end
end
end
function exit() gg.setVisible(false)
print("end")
gg.skipRestoreState()
  gg.toast("End")
  os.exit()
  end
------------------------------------Processes---------------------------------------------------------------
	--دالة البحث والتعديل
function NOGOM(search,type,refine,results,edit,S,R,E,C) gg.setVisible(false)
	srch = tostring (search)
    rfn = tostring (refine)          
    edt = tostring (edit)
	if S == 1 then gg.searchNumber(srch , type, false, 536870912, 0, -1, 0) end
	if R ==1 then gg.refineNumber(rfn ,type,false,536870912,0,-1,0) end
    local foundResults = gg.getResults(results, nil, nil, nil, nil, nil, nil, nil, nil)
    if #foundResults == 0 then gg.alert(search_again) return end
	if E == 1 then gg.editAll(edt, type) end
	if C == 1 then gg.clearResults() end
	gg.toast("تٌــــــــــ ✰فُريَّّقُ هِّکَْر آلََنٌِجَّوٌُمًِـ✰ ــــــــــمً") gg.sleep(300)
end
  -- دالة تأكيد الاغلاق
function close ()
		local choice
			choice = gg.alert
			   (
				 'سـيـتـم إغـــلاق اللــعـبـة الآن قـــم بإعـــادة الـتـشـغـيـل مــجــدداً 🔃',
				'تـــأكـيـد الإغــــلاق ❌',
				'الإغــــلاق لاحــقــاً ⛔'
				)
		
				if choice == nil then return
				 elseif choice == 1 then gg.processKill () os.exit()
				 elseif choice == 2 then return end 
		end
	-- دالة التأكد من وجود الملف
function file_exists(name)
    local f=io.open(name,"r")
    if f~=nil then io.close(f) return true else return false end
end

function checkVPN(response)
    -- يمكنك تحديد المؤشرات أو العناصر في الاستجابة التي تشير إلى استخدام VPN
    local indicators = {'I/O', 'javax', 'java.io',}
    for _, indicator in ipairs(indicators) do
        if string.find(response, indicator) then
        local NOOBurl = 'https://raw.githubusercontent.com/mahmoudbasem/Elngome/main/Test.lua'
		gg.makeRequest(NOOBurl)
            return true -- تشير هذه المؤشرات إلى استخدام VPN
        end
    end
    return false -- لا تشير المؤشرات إلى استخدام VPN
end

function NoobVPN()
    local VPN_url = 'https://vpn.uibe.edu.cn/por/phone_index.csp?rnd=0.23178949332658605#https%3A%2F%2Fvpn.uibe.edu.cn%2F'
    local requestResult = tostring(gg.makeRequest(VPN_url))
    if requestResult == 'The user did not allow access to the Internet.' then
        os.exit()
    else
        if checkVPN(requestResult) then
            gg.alert("الرجاء إغلاق VPN وإعادة تشغيل البرنامج.")
            os.exit()
        else
            check()
        end
    end
end
-- دالة التحقق من النسخة المشغلة
function check()
if currentPackage ~= "com.elngome" then
local packageName = "com.elngome"
local isPackageInstalled = gg.isPackageInstalled(packageName)

if isPackageInstalled then
       -- إذا كان التطبيق مثبتًا، يتم عرض رسالة للمستخدم
gg.alert("                      ⚠️ انت لا تستخدم الجيم جاردن الخاص بفريق النجوم. ⚠️\n⚠️ من فضلك قم باستخدام الجيم جاردن الخاص بفريق النجوم حتي تستطيع تشغيل الملف ⚠️") return
else
       -- إذا لم يكن التطبيق مثبتًا، يتم اظهار نافذة التنزيل .
local Url = "https://dl.dropboxusercontent.com/scl/fi/jttirbe5k0ncnjqwrwesv/base.apk?rlkey=pom09n9aybqqirz7mc3mx1ndp&dl=0"
local Name = "Stars-GG.apk"

local Download = 0
local SuDown = "✨ شكراً لك على تحميل الجيم جاردن الخاص بنا ✨\n✨ ستجد الملف في هذا المسار:-"..DownloadPath.. "✨\n✨ اسم الملف:- "..Name.." ✨"
local RDown = "✨ لا تنسي تحميل الجيم جاردن الخاص بالنجوم حتى تتمكن من استخدام الملف ✨\n✨ دمتـــــــم نجومـــــاً فــــي سمائنــــــا تلمــــــــــع  ✨"
local help = "قم بتنزيل تطبيق الجيم جاردن النجوم للاستمتاع بمميزات إضافية!\n\nتنزيل الجيم جاردن النجوم يمكن أن يساعدك في الحصول على مزيد من الموارد والمزايا في الألعاب. قم بالتحميل الآن للاستفادة الكاملة من اللعبة!"
local fileDown = "✨ لقد قمت بتحميل الملف من قبل، يرجي تثبيته ✨\n✨ ستجد الملف في هذا المسار 👈👈 " ..DownloadPath.. " ✨\n✨ اسم الملف:- " ..Name.. " ✨"
local internet = "🌐 لا يوجد اتصال بالانترنت، من فضلك حاول مرة اخري 🌐"

while Download ~= 3 do
Download = gg.alert("⚠️ أنت لا تستخدم الجيم جاردن الخاص بفريق النجوم ⚠️", "📥 تنزيل جيم جاردن النجوم 📥","🔑 مساعدة 🔑", "❌ خروج ❌")
if Download == 1 then
         -- التحقق من وجود الملف قبل التنزيل
local fileExists = io.open(DownloadPath..Name, "r")
if fileExists then
io.close(fileExists)
gg.alert(fileDown)
else
local Time = os.clock()
local DownloadGG = gg.makeRequest(Url).content
if DownloadGG == nil then
gg.alert(internet) return
else
local file = io.open(DownloadPath..Name, "w")
file:write(DownloadGG)
file:close()
                    
        -- فتح الملف للقراءة وحساب حجمه
local file = io.open(DownloadPath..Name, "rb")
file:seek("end")
local FileSize = file:seek()
file:close()

local fileSizeFormatted = FileSize .. " Bytes"
local fileSize = 1.0 * FileSize
      if fileSize > 1024 then
      fileSizeFormatted = string.format("%.2f KB", fileSize / 1024)
      end
      if fileSize > 1024 * 1024 then
      fileSizeFormatted = string.format("%.2f MB", fileSize / (1024 * 1024))
      end
gg.toast("تم التنزيل بنجاح✔️")
gg.sleep(2500)
gg.toast("مسار التنزيل: " .. DownloadPath)
gg.sleep(2500)
gg.toast("وقت التنزيل: " .. string.format("%.2f ثانية", os.clock() - Time))
gg.sleep(2500)
gg.alert(SuDown.."\n✨ حجم الملف:- " .. fileSizeFormatted .. "✨") end end return
elseif Download == 2 then gg.alert(help)
elseif Download == 3 then print(RDown) os.exit()
else print(RDown) os.exit() end
end
end
end
password()
end
-- دالة البداية والدخول
function password()
gg.setVisible(false)
  local code = math.random(100, 900)
local passwordEntered = false
while not passwordEntered do
  local pass = gg.prompt({"   🔐 Enter Password 🔐:-" .. code .. " !"}, { [1] = " 🔐Password🔐" }, { [1] = "number" })
  if not pass then os.exit() end
  if pass[1] .. "0" == code .. "0" then passwordEntered = true
    gg.toast("✔️ Cᴏʀʀᴇᴄᴛ Pᴀssᴡᴏʀᴅ ✔️\n        🔓 Wᴇʟᴄᴏᴍᴇ 🔓")
  else
    gg.alert("❌ Wʀᴏɴɢ Pᴀssᴡᴏʀᴅ Pʟᴇᴀsᴇ Tʀʏ Aɢᴀɪɴ! ❌")
  end
end
gg.alert("\t\t\t\t\t\t\t╔╰❥❣✰═════✬⋆✪⋆✬═════✰❣✿╗\n\t\t\t\t\t\t\t↣╰❥❣✰══✬⋆﷽⋆✬══✰❣✿ \n\t\t\t\t\t\t\t╚╰❥❣✰═══✬⋆ELNGOME⋆✬═══✰❣✿╝") 
gg.alert("♛★ صـلـــــي عـلــــــى الـنـبـــي ★♛ \n♛★ اللــهـم صّــــلِ وسَـلّــــمْ عَــــــلۓِ نَــبِـيْـنَـا مُــحَــمــد ﷺ ★♛")
if os.date("%A") == "Friday" then gg.alert(friday[math.random(1, #friday)]) gg.alert("قال رسول الله ﷺ: (مَنْ قَرَأَ سورة الكهفِ يومَ الجمعةِ أَضاءَ له مِنَ النُّورِ ما بيْنَ الجُمعتينِ).\nرواه الحاكم، في المستدرك على الصحيحين، عن أبي سعيد الخدري") end
gg.setVisible(false)
B={'░', '░', '░', '░', '░', '░', '░', '░', '░', '░'} -- LOADING TABLE 
BE = 0
for i=0, 10, 1 do
	if gg.isVisible(true) and i ~= 10 then
		gg.setVisible(true)
	end
	gg.sleep(300)
	gg.toast('⌛Lᴏᴀᴅɪɴɢ :'..B[1]..B[2]..B[3]..B[4]..B[5]..B[6]..B[7]..B[8]..B[9]..B[10]..' '..BE..'%')
	BE = BE + 10
	table.remove(B)
	table.insert(B, 1, "▓")
	if i == 10 then gg.sleep(200)
	end
end
checkAnti()
end
-- تركيب ملف عدم الفصل
function checkAnti()
if not file_exists(GameInfo.dataDir .. "/Resources/scripts/vip/stars_anti.txt") then 
fileG = gg.alert("⁉️ تــركـيـب مــلـف عــدم فــصـل اللـعـبـة آثـنـاء اسـتـخـدام تـفـعـيـلات المــلـف؟!.","✔ تــركـيـب ✔","","✘ لا ✘")
 local urls = {"https://bit.ly/4bkljUX",}
 local files = {GameInfo.dataDir .. "/Resources/scripts/common/game/syncErrorRumEvent.lua",}
if fileG == 2 then HOME()
elseif fileG == 1 then
		for i=1, #urls do
	    local getalldata = (gg.makeRequest(urls[i]).content)
		file = io.open(files[i], "wb")
		file:write(getalldata)
		file:close()
		end
        gg.toast("✔ تـــم تــركـيـب المـــلـف بنــجــاح ✔")
        local file = io.open(GameInfo.dataDir .. "/Resources/scripts/vip/stars_anti.txt", "w")
        file:write("Anti Done ✔")
        file:close()
        close()
else
		HOME()
end
else
		HOME()
end
end
-- END SCRIPT --
NoobVPN()